{"id":956,"date":"2023-08-30T21:40:24","date_gmt":"2023-08-31T02:40:24","guid":{"rendered":"https:\/\/oyshop.com.co\/?p=956"},"modified":"2023-08-30T21:42:46","modified_gmt":"2023-08-31T02:42:46","slug":"que-son-las-amenazas-persistentes-avanzadas","status":"publish","type":"post","link":"https:\/\/oyshop.com.co\/que-son-las-amenazas-persistentes-avanzadas\/","title":{"rendered":"\u00bfQu\u00e9 son las amenazas persistentes avanzadas?"},"content":{"rendered":"\n<blockquote class=\"wp-block-quote\">\n<p>Los grupos de amenazas persistentes avanzadas buscan acceder a informaci\u00f3n cr\u00edtica y desestabilizar a compa\u00f1\u00edas de sectores cr\u00edticos y administraciones p\u00fablicas<\/p>\n<\/blockquote>\n\n\n\n<p>La era de los esp\u00edas circunspectos y silenciosos que John le Carr\u00e9 retrat\u00f3 para la posteridad en novelas como&nbsp;<em>El esp\u00eda que surgi\u00f3 el fr\u00edo<\/em>, termin\u00f3 con el final de la Guerra Fr\u00eda. Hoy en d\u00eda, el espionaje tiene lugar en el mundo digital a trav\u00e9s de&nbsp;<strong>amenazas persistentes avanzadas<\/strong>, lanzadas por&nbsp;<strong>grupos de ciberdelincuentes<\/strong>&nbsp;esponsorizados por estados que desean obtener informaci\u00f3n de gobiernos, compa\u00f1\u00edas, medios extranjeros o desestabilizar a otros pa\u00edses.<\/p>\n\n\n\n<p>En las \u00faltimas semanas se han hecho p\u00fablicas dos<strong>&nbsp;campa\u00f1as de amenazas persistentes avanzadas<\/strong>&nbsp;puestas en marcha por un grupo chino y otro norcoreano. La primera de ellas, conocida como&nbsp;<a href=\"https:\/\/www.bleepingcomputer.com\/news\/security\/hackers-target-european-government-entities-in-smugx-campaign\/\" target=\"_blank\" rel=\"noreferrer noopener\">SmugX<\/a>, atacaba a embajadas para obtener informaci\u00f3n clave sobre la pol\u00edtica exterior de pa\u00edses europeos como Reino Unido, Rep\u00fablica Checa o Hungr\u00eda. La segunda, lanzada por el grupo APT Kimsuky iba dirigida a robar datos de actores estrat\u00e9gicos como centros de investigaci\u00f3n o medios de comunicaci\u00f3n.<\/p>\n\n\n\n<p>Estos casos recientes evidencian una tendencia clave en el \u00e1mbito de la ciberseguridad a nivel global: el&nbsp;<strong>auge de las amenazas persistentes avanzadas<\/strong>, cuyo impacto en compa\u00f1\u00edas y administraciones p\u00fablicas puede llegar a ser devastador. De ah\u00ed que la mejora de la resiliencia frente a esta clase de amenazas se haya convertido en una cuesti\u00f3n de vital importancia para miles de empresas e instituciones de todo el planeta.<\/p>\n\n\n\n<p>A continuaci\u00f3n, vamos a profundizar en&nbsp;<strong>qu\u00e9 son las amenazas persistentes avanzadas<\/strong>, cu\u00e1les son sus objetivos, qui\u00e9nes est\u00e1n detr\u00e1s de ellas y c\u00f3mo se pueden preparar las compa\u00f1\u00edas y administraciones frente a estas peligrosas amenazas, gracias a los&nbsp;<a href=\"https:\/\/www.tarlogic.com\/es\/threat-hunting\/\" target=\"_blank\" rel=\"noreferrer noopener\"><strong>servicios de Threat Hunting<\/strong><\/a>&nbsp;y los&nbsp;<a href=\"https:\/\/www.tarlogic.com\/es\/servicios-red-team\/\" target=\"_blank\" rel=\"noreferrer noopener\"><strong>ejercicios de Red Team<\/strong><\/a>.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">1. Deconstruyendo el concepto APT<\/h2>\n\n\n\n<p>Las amenazas persistentes avanzadas son popularmente conocidas a trav\u00e9s de las iniciales del concepto en ingl\u00e9s,&nbsp;<strong>APT<\/strong>:&nbsp;<strong>advanced persistent threats<\/strong>. Estas tres palabras nos sirven para realizar una primera aproximaci\u00f3n a este concepto esencial en el mundo de la ciberseguridad:<\/p>\n\n\n\n<ul>\n<li>Advanced. Al usar el adjetivo avanzadas, se busca hacer hincapi\u00e9 en que esta clase de amenazas emplea t\u00e9cnicas, t\u00e1cticas y procedimientos m\u00e1s complejos de prevenir, detectar y combatir que los utilizados ciberataques comunes. Ello implica que los&nbsp;<strong>mecanismos de protecci\u00f3n frente a las amenazas persistentes avanzadas<\/strong>&nbsp;tambi\u00e9n han de ser sofisticados e innovadores.<\/li>\n\n\n\n<li>Persistent. Una de las claves de estas amenazas avanzadas es su persistencia. Es decir, su extensi\u00f3n a lo largo del tiempo. De tal forma que los ataques logran pasar desapercibidos durante un periodo temporal extraordinariamente amplio, que permite a los actores hostiles acceder a un mayor volumen de informaci\u00f3n y provocar un da\u00f1o mayor en las organizaciones atacadas.<\/li>\n\n\n\n<li>Threats. Resulta evidente que esta clase de ataque supone una gran amenaza para las compa\u00f1\u00edas y las administraciones, pudiendo generar graves consecuencias econ\u00f3micas, reputacionales y legales y&nbsp;<strong>menoscabar la continuidad de negocio<\/strong>&nbsp;y la estrategia de la organizaci\u00f3n.<\/li>\n<\/ul>\n\n\n\n<p>M\u00e1s all\u00e1 de las tres palabras que conforman el concepto, el National Institute of Standards and Technology de Estados Unidos,&nbsp;<a href=\"https:\/\/csrc.nist.gov\/glossary\/term\/advanced_persistent_threat\" target=\"_blank\" rel=\"noreferrer noopener\">define<\/a>&nbsp;a las&nbsp;<strong>amenazas persistentes avanzadas<\/strong>&nbsp;poniendo el foco en cinco aspectos esenciales:<\/p>\n\n\n\n<ul>\n<li>Los adversarios, su experiencia, su motivaci\u00f3n y los recursos de los que disponen.<\/li>\n\n\n\n<li>La utilizaci\u00f3n de&nbsp;<strong>m\u00faltiples vectores de ataque<\/strong>.<\/li>\n\n\n\n<li>Los objetivos de los actores hostiles:&nbsp;<strong>exfiltrar informaci\u00f3n<\/strong>&nbsp;y socavar a la organizaci\u00f3n.<\/li>\n\n\n\n<li>La duraci\u00f3n y evoluci\u00f3n de las amenazas.<\/li>\n\n\n\n<li>El nivel de interacci\u00f3n necesario para acometer los objetivos con \u00e9xito.<\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\">2. \u00bfEn qu\u00e9 se diferencian las amenazas persistentes avanzadas de los ataques tradicionales?<\/h2>\n\n\n\n<p>A ra\u00edz de lo que venimos de se\u00f1alar, podemos vislumbrar qu\u00e9 diferencia a las&nbsp;<strong>amenazas persistentes avanzadas<\/strong>&nbsp;de las comunes.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">2.1. Tipolog\u00eda de los actores hostiles<\/h3>\n\n\n\n<p>Los delincuentes detr\u00e1s de las&nbsp;<strong>amenazas persistentes avanzadas<\/strong>&nbsp;presentan sofisticados niveles de experiencia y disponen de cuantiosos recursos. Esto les permite dise\u00f1ar e implementar ataques mucho m\u00e1s complejos y disponer de m\u00e1s herramientas para vencer los mecanismos de defensa de una organizaci\u00f3n y cumplir con los objetivos.<\/p>\n\n\n\n<p>Los&nbsp;<strong>grupos APT<\/strong>&nbsp;destacan por su elevado nivel de experiencia, contar con una motivaci\u00f3n clara, conjugar m\u00faltiples vectores de ataque y disponer de una meta perfectamente definida (robar propiedad intelectual, espionaje industrial o gubernamental\u2026).<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">2.2. Vectores de ataque<\/h3>\n\n\n\n<p>Una de las claves que nos sirve para diferenciar a las&nbsp;<strong>amenazas persistentes avanzadas<\/strong>&nbsp;y destacar su peligrosidad son los vectores de ataque que emplean los actores hostiles. \u00bfPor qu\u00e9?<\/p>\n\n\n\n<p>Los delincuentes no recurren a un \u00fanico vector de ataque para vulnerar un activo IT de una compa\u00f1\u00eda, sino que emplean m\u00faltiples vectores, lo que tiene como consecuencia que las amenazas persistentes avanzadas sean m\u00e1s sofisticadas y complejas. As\u00ed, este tipo de ataques puede combinar el empleo de t\u00e9cnicas de ingenier\u00eda social, la&nbsp;<strong>explotaci\u00f3n de vulnerabilidades de d\u00eda 0<\/strong>&nbsp;o el uso de malware.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">2.3. Duraci\u00f3n y alcance de los ataques<\/h3>\n\n\n\n<p>Las&nbsp;<strong>amenazas persistentes avanzadas<\/strong>&nbsp;no son ataques que golpean una sola vez, sino que buscan infiltrarse en la infraestructura tecnol\u00f3gica de la organizaci\u00f3n y lograr la m\u00e1xima persistencia en ella, consiguiendo, a su vez, un acceso continuado en el tiempo.<\/p>\n\n\n\n<p>Ello conlleva que los actores hostiles deban pasar desapercibidos y conseguir que los ataques queden latentes en los sistemas corporativos o gubernamentales y sean monitoreados de forma continua hasta la consecuci\u00f3n de los objetivos maliciosos.<\/p>\n\n\n\n<p>Asimismo, debemos a\u00f1adir que los grupos APT buscan obtener el m\u00e1ximo alcance para poder&nbsp;<strong>infiltrarse en toda la infraestructura tecnol\u00f3gica<\/strong>&nbsp;de la organizaci\u00f3n y recabar la mayor cantidad de informaci\u00f3n posible.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">2.4. Ejecuci\u00f3n<\/h3>\n\n\n\n<p>Muchos ciberataques se ponen en marcha recurriendo a la automatizaci\u00f3n. Por la contra, las&nbsp;<strong>amenazas persistentes avanzadas<\/strong>&nbsp;se caracterizan por ser ejecutadas de forma manual. De tal forma que los actores hostiles ejecutan todas las fases de la Cyber Kill Chain para asegurarse de alcanzar los objetivos marcados.<\/p>\n\n\n\n<p>De ah\u00ed que podamos afirmar que las amenazas persistentes avanzadas se caracterizan por ser&nbsp;<strong>ataques dirigidos y organizados<\/strong>, sustentados en objetivos perfectamente definidos.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">2.5. Targets espec\u00edficos<\/h3>\n\n\n\n<p>Gracias a las herramientas que permiten automatizar los ciberataques, muchos se lanzan contra un amplio n\u00famero de objetivos. Por ejemplo, una campa\u00f1a de phishing que se dirige a miles de cuentas de correo electr\u00f3nico. Por la contra, las amenazas persistentes avanzadas se dirigen contra targets espec\u00edficos, como profesionales concretos de una determinada organizaci\u00f3n.<\/p>\n\n\n\n<p>Entre los targets habituales de los grupos APT se encuentran gobiernos, compa\u00f1\u00edas, personas relevantes, redes o infraestructura cr\u00edtica, por ejemplo, plantas energ\u00e9ticas u oleoductos.<\/p>\n\n\n\n<p>Esta situaci\u00f3n pone en evidencia la&nbsp;<strong>existencia de recursos y capacidades de inteligencia<\/strong>&nbsp;(OSINT, SOCMINT) por parte de los actores maliciosos.<\/p>\n\n\n\n<figure class=\"wp-block-image size-full is-resized\"><img loading=\"lazy\" decoding=\"async\" src=\"https:\/\/oyshop.com.co\/wp-content\/uploads\/2023\/08\/109271773_l-1024x724-1.jpg\" alt=\"\" class=\"wp-image-957\" style=\"object-fit:cover;width:697px;height:474px\" width=\"697\" height=\"474\"\/><\/figure>\n\n\n\n<div style=\"height:37px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<h2 class=\"wp-block-heading\">3. Objetivos de las amenazas persistentes avanzadas<\/h2>\n\n\n\n<p>Las caracter\u00edsticas de las&nbsp;<strong>amenazas persistentes avanzadas<\/strong>&nbsp;guardan una relaci\u00f3n directa con los objetivos de los grupos APT. Estos ataques complejos, que conjugan varios vectores de ataques y t\u00e9cnicas sofisticadas, buscan infiltrarse el m\u00e1ximo tiempo posible en la infraestructura IT sin ser identificados para:<\/p>\n\n\n\n<ol>\n<li><strong>Robar propiedad intelectual<\/strong>&nbsp;y\/o industrial de la compa\u00f1\u00eda atacada.<\/li>\n\n\n\n<li>Sustraer datos clasificados o secretos, tanto de las empresas como de instituciones.<\/li>\n\n\n\n<li>Provocar da\u00f1os atacando a sistemas de control industrial (ICS), pudiendo llegar a&nbsp;<strong>afectar a la seguridad y salud de las personas<\/strong>. Por ejemplo, paralizando la actividad de una compa\u00f1\u00eda el\u00e9ctrica.<\/li>\n\n\n\n<li><strong>Acceder a datos personales<\/strong>&nbsp;e informaci\u00f3n privada de clientes, trabajadores, socios o ciudadanos.<\/li>\n\n\n\n<li>Tomar el control de un sistema corporativo.<\/li>\n\n\n\n<li>Conseguir informaci\u00f3n de valor para&nbsp;<strong>lanzar futuros ataques<\/strong>.<\/li>\n<\/ol>\n\n\n\n<h2 class=\"wp-block-heading\">4. Ataques dirigidos y bien organizados para dar en la diana<\/h2>\n\n\n\n<p>A la luz de las caracter\u00edsticas y objetivos que hemos esbozado, podemos hacernos la siguiente pregunta:<strong>&nbsp;\u00bfqu\u00e9 buscan las amenazas persistentes avanzadas?<\/strong><\/p>\n\n\n\n<p>La complejidad de las acciones, el nivel de preparaci\u00f3n de los delincuentes que las desarrollan y la cantidad de recursos que se necesitan para ejecutarlas con \u00e9xito implican que las amenazas persistentes avanzadas tengan, en primer lugar, targets espec\u00edficos, a diferencia de otros ataques menos complejos y que se automatizan.<\/p>\n\n\n\n<p>De ah\u00ed que se\u00f1alemos que las APT se tratan de ataques dirigidos hacia targets concretos y no de ataques a discreci\u00f3n, que buscan impactar en el mayor n\u00famero de v\u00edctimas potenciales. O, dicho de una forma m\u00e1s prosaica, mediante las amenazas persistentes avanzadas los delincuentes buscan dar en la diana, mientras que en los ataques automatizados masivos echan la red en el mar, sin importar qu\u00e9 vaya a caer en sus manos.<\/p>\n\n\n\n<p>Aclarada esta cuesti\u00f3n, \u00bfcontra qui\u00e9n se dirigen las amenazas persistentes avanzadas? Especialmente contra&nbsp;<strong>instituciones p\u00fablicas clave<\/strong>&nbsp;como los departamentos o ministerios ligados a la seguridad, la defensa, la pol\u00edtica exterior o la investigaci\u00f3n. As\u00ed como contra&nbsp;<strong>compa\u00f1\u00edas de sectores cr\u00edticos<\/strong>, como el financiero, la salud, las telecomunicaciones, el transporte o la energ\u00eda.<\/p>\n\n\n\n<p>\u00bfC\u00f3mo se infiltran los actores hostiles en la infraestructura IT de esta clase de organizaciones? Combinando diferentes t\u00e1cticas, t\u00e9cnicas y procedimientos para obtener acceso a los sistemas corporativos, instalar&nbsp;<em>backdoors<\/em>,&nbsp;<strong>escalar privilegios<\/strong>&nbsp;o&nbsp;<strong>realizar movimientos laterales<\/strong>&nbsp;para lograr los objetivos maliciosos.<\/p>\n\n\n\n<p>Frente a otros ataques m\u00e1s sencillos, las&nbsp;<strong>amenazas persistentes avanzadas<\/strong>&nbsp;se desarrollan a lo largo de una gran cantidad de tiempo, tanto por su complejidad como por su misi\u00f3n de persistir durante un plazo temporal muy amplio para acrecentar su impacto en la organizaci\u00f3n atacada.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">5. Grupos APT: \u00bfQui\u00e9n est\u00e1 detr\u00e1s de estas amenazas?<\/h2>\n\n\n\n<p>Los<strong>&nbsp;grupos APT<\/strong>&nbsp;son aquellos que dise\u00f1an y ejecutan amenazas persistentes avanzadas para cumplir sus objetivos delictivos. Para ello, desarrollan herramientas, t\u00e9cnicas, t\u00e1cticas y procedimientos que requieren de elevados conocimientos t\u00e9cnicos y una amplia experiencia. La complejidad de las amenazas persistentes avanzadas exige que los delincuentes que forman parte de estos grupos presenten una gran pericia y que, adem\u00e1s, dispongan de cuantiosos recursos para llevar a cabo sus actividades delictivas.<\/p>\n\n\n\n<p>Por ello, en muchos casos, como los dos que mentamos al inicio del art\u00edculo, los grupos APT son esponsorizados por estados.<\/p>\n\n\n\n<p>Sin embargo, tambi\u00e9n existen grupos APT que no tienen una relaci\u00f3n directa con ning\u00fan gobierno, sino que su objetivo es infiltrarse en compa\u00f1\u00edas o administraciones para extorsionarlas, como fue el caso del ataque lanzado por el grupo RansomHouse contra el Hospital Cl\u00ednic de Barcelona; o para&nbsp;<strong>vender informaci\u00f3n sensible a la competencia<\/strong>.<\/p>\n\n\n\n<p>A\u00fan as\u00ed, lo cierto es que muchos grupos APT tienen estrechos lazos con diversos estados (Rusia, China, Ir\u00e1n\u2026) y su objetivo es contribuir a&nbsp;<strong>desestabilizar a los estados occidentales<\/strong>, ya sea atacando a sus instituciones o a sus compa\u00f1\u00edas.<\/p>\n\n\n\n<p>Sin ir m\u00e1s lejos, el equipo de Threat Hunting de Tarlogic Security hizo p\u00fablica una investigaci\u00f3n sobre el grupo APT28, tambi\u00e9n conocido popularmente como&nbsp;<a href=\"https:\/\/www.eldiario.es\/tecnologia\/opera-fancy-bear-verdaderos-hackers-rusos-servicio-kremlin_1_10021847.html\" target=\"_blank\" rel=\"noreferrer noopener\">Fancy Bear<\/a>. Este grupo que amenazas persistentes avanzadas ha atacado al presidente de Francia, Emanuel Macron, al Bundestag alem\u00e1n, al CSIC espa\u00f1ol o al Comit\u00e9 Nacional Dem\u00f3crata estadounidense.<\/p>\n\n\n\n<p>Los<strong>&nbsp;grupos de amenazas persistentes avanzadas<\/strong>&nbsp;van en aumento y su impacto en el terreno de la ciberseguridad y la protecci\u00f3n de las empresas, las administraciones y las personas tambi\u00e9n. De ah\u00ed que los profesionales de<strong>&nbsp;Threat Intelligence<\/strong>&nbsp;y&nbsp;<strong>Threat Hunting<\/strong>&nbsp;sean claves a la hora de entender c\u00f3mo operan los diferentes grupos APT y, as\u00ed, poder mejorar la resiliencia frente a sus acciones maliciosas.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">5.1. MITRE ATT&amp;CK y el mapeo de los grupos APT<\/h3>\n\n\n\n<p>Precisamente, el framework MITRE ATT&amp;CK, centrado en estudiar las t\u00e1cticas, t\u00e9cnicas y procedimientos de los ciberdelincuentes, lleva a cabo una labor de recopilaci\u00f3n de informaci\u00f3n sobre los grupos APT. As\u00ed, MITRE ATT&amp;CK pone a disposici\u00f3n de los profesionales de ciberseguridad y las organizaciones datos como:<\/p>\n\n\n\n<ul>\n<li>Descripci\u00f3n de los grupos.<\/li>\n\n\n\n<li>Recopilaci\u00f3n de todas las nomenclaturas que se han empleado para referenciarlos.<\/li>\n\n\n\n<li>T\u00e9cnicas y sub-t\u00e9cnicas que emplean y c\u00f3mo las han usado.<\/li>\n\n\n\n<li>Software que usan para conseguir sus objetivos y qu\u00e9 t\u00e9cnicas permite llevar a cabo cada soluci\u00f3n.<\/li>\n<\/ul>\n\n\n\n<figure class=\"wp-block-image size-full is-resized\"><img loading=\"lazy\" decoding=\"async\" src=\"https:\/\/oyshop.com.co\/wp-content\/uploads\/2023\/08\/cybersecurity-1.jpg\" alt=\"\" class=\"wp-image-958\" style=\"object-fit:cover;width:697px;height:474px\" width=\"697\" height=\"474\"\/><\/figure>\n\n\n\n<div style=\"height:43px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<h2 class=\"wp-block-heading\">6. Inteligencia y Threat Hunting para cortar la Cyber Kill Chain de las amenazas persistentes avanzadas<\/h2>\n\n\n\n<p>\u00bfC\u00f3mo pueden las organizaciones hacer frente a las amenazas persistentes avanzadas? En primer lugar, cortando su&nbsp;<strong>Cyber Kill Chain<\/strong>&nbsp;antes de que logren cumplir sus objetivos maliciosos. En esta tarea entren en juego los profesionales de ciberinteligencia y los threat hunters.<\/p>\n\n\n\n<ul>\n<li><strong>Servicios de ciberinteligencia<\/strong>. Esta clase de servicios son esenciales para detectar las amenazas persistentes avanzadas durante sus tres primeras fases:\n<ul>\n<li>Reconocimiento<\/li>\n\n\n\n<li>Armamento<\/li>\n\n\n\n<li>Distribuci\u00f3n<\/li>\n<\/ul>\n<\/li>\n\n\n\n<li><strong>Servicios de Threat Hunting<\/strong>. Los threat hunters juegan un papel crucial en las otras cuatro fases de la Cyber Kill Chain:\n<ul>\n<li>Explotaci\u00f3n<\/li>\n\n\n\n<li>Instalaci\u00f3n<\/li>\n\n\n\n<li>Comando y control<\/li>\n\n\n\n<li>Acciones<\/li>\n<\/ul>\n<\/li>\n<\/ul>\n\n\n\n<p>La inteligencia es fundamental a la hora de poner en marcha las&nbsp;<strong>amenazas persistentes avanzadas<\/strong>, puesto que los ciberdelincuentes deben conocer con precisi\u00f3n a las organizaciones que van a atacar, su infraestructura IT y su estrategia de seguridad. Y, por eso mismo, es fundamental a la hora de comprender qu\u00e9 TTP emplean los actores hostiles cuando realizan tareas de investigaci\u00f3n y desarrollan herramientas o procedimientos para lanzar sus ataques.<\/p>\n\n\n\n<p>Por su parte, los profesionales que realizan&nbsp;<strong>Threat Hunting proactivo<\/strong>&nbsp;han de rastrear la presencia de amenazas persistentes avanzadas en los sistemas de una organizaci\u00f3n. \u00bfC\u00f3mo? Analizando la actividad en los endpoints o detectando amenazas partiendo de&nbsp;<strong>hip\u00f3tesis de compromiso<\/strong>&nbsp;y usando la telemetr\u00eda.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">7. C\u00f3mo mejorar la resiliencia frente a las amenazas persistentes avanzadas<\/h2>\n\n\n\n<p>Las&nbsp;<strong>amenazas persistentes avanzadas<\/strong>&nbsp;y los grupos que las dise\u00f1an y ejecutan suponen un peligro para la seguridad de miles de empresas, pero tambi\u00e9n para las instituciones y el conjunto de la ciudadan\u00eda.<\/p>\n\n\n\n<p>Por ello, es fundamental que las compa\u00f1\u00edas y las administraciones p\u00fablicas sean capaces de&nbsp;<strong>mejorar su resiliencia frente a las APT<\/strong>&nbsp;y, as\u00ed, ser capaces de mejorar las capacidades de detecci\u00f3n, respuesta, contenci\u00f3n y recuperaci\u00f3n.<\/p>\n\n\n\n<p><strong>Tarlogic Security<\/strong>&nbsp;ofrece a las empresas e instituciones servicios de Red Team y Threat Hunting que a\u00fanan capacidades de seguridad ofensiva y defensiva para ayudarlas a mejorar su resiliencia APT.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">7.1. Servicios de Threat Hunting para dise\u00f1ar oportunidades de mejora<\/h3>\n\n\n\n<p>El equipo de Threat Hunting de Tarlogic lleva a cabo una&nbsp;<strong>monitorizaci\u00f3n permanente de los principales grupos APT<\/strong>&nbsp;del mundo con el objetivo de analizar en profundidad las t\u00e9cnicas, t\u00e1cticas y procedimientos (TTP) que emplean esta clase de actores hostiles.<\/p>\n\n\n\n<p>Todo este conocimiento conforma una amplia base de datos que sirve para identificar y dise\u00f1ar oportunidades de detecci\u00f3n para hacer frente a las nuevas TTP empleadas por los grupos APT.<\/p>\n\n\n\n<p>Mediante esta estrategia de Threat Hunting Proactivo, los profesionales de Tarlogic ayudan a las compa\u00f1\u00edas a&nbsp;<strong>mejorar sus capacidades defensivas frente a las amenazas persistentes avanzadas<\/strong>.<\/p>\n\n\n\n<p>As\u00ed, para conseguir optimizar la resiliencia frente a las TTP de los grupos APT, una organizaci\u00f3n debe ser capaz de responder afirmativamente a tres preguntas b\u00e1sicas:<\/p>\n\n\n\n<ul>\n<li>\u00bfExiste telemetr\u00eda asociada a la TTP?<\/li>\n\n\n\n<li>\u00bfSe ha implantado un proceso eficaz para detectar la TTP y analizar si se trata de actividad maliciosa?<\/li>\n\n\n\n<li>\u00bfEs posible investigar un caso hasta encontrar la causa ra\u00edz del compromiso y evaluar el impacto causado por la APT?<\/li>\n<\/ul>\n\n\n\n<h3 class=\"wp-block-heading\">7.2. Ejercicios de Red Team para optimizar las defensas<\/h3>\n\n\n\n<p>La soluci\u00f3n que ofrece Tarlogic a las empresas para hacer frente a las amenazas persistentes avanzadas incluye, tambi\u00e9n, la prestaci\u00f3n de&nbsp;<strong>servicios de Red Team<\/strong>&nbsp;para dise\u00f1ar e implementar ejercicios de compromiso mediante APT.<\/p>\n\n\n\n<p>Los profesionales de la compa\u00f1\u00eda de ciberseguridad acuerdan con la empresa que ha contratado estos servicios el dise\u00f1o del ejercicio de compromiso mediante APT: vectores de entrada, actividades de impacto\u2026 Durante su ejecuci\u00f3n, el equipo de Tarlogic pondr\u00e1 en marcha un ataque dirigido contra la organizaci\u00f3n de cara a:<\/p>\n\n\n\n<ul>\n<li>Acceder a la infraestructura IT.<\/li>\n\n\n\n<li>Infectar sistemas corporativos<\/li>\n\n\n\n<li>Realizar movimientos laterales y escalar privilegios.<\/li>\n\n\n\n<li><strong>Controlar los activos comprometidos a lo largo del tiempo<\/strong>, asegurando persistencia en la infraestructura<\/li>\n\n\n\n<li>Realizar las actividades de impacto acordadas, que van desde el despliegue de ransomware hasta la exfiltraci\u00f3n de informaci\u00f3n confidencial.<\/li>\n<\/ul>\n\n\n\n<h4 class=\"wp-block-heading\">7.2.1. Beneficios<\/h4>\n\n\n\n<p>\u00bfCu\u00e1les son los beneficios de estos&nbsp;<strong>ejercicios de compromiso<\/strong>&nbsp;dise\u00f1ados y ejecutados por un Red Team altamente cualificado y con una amplia experiencia a sus espaldas?<\/p>\n\n\n\n<ul>\n<li><strong>Evaluar los riesgos de una APT<\/strong>&nbsp;para una organizaci\u00f3n y sus activos cr\u00edticos.<\/li>\n\n\n\n<li>Analizar las capacidades de detecci\u00f3n y respuesta de la organizaci\u00f3n ante las amenazas persistentes avanzadas.<\/li>\n\n\n\n<li>Determinar el nivel de madurez y resiliencia de las capacidades defensivas de la compa\u00f1\u00eda.<\/li>\n\n\n\n<li><strong>Establecer posibilidades de mejora de las capas defensivas<\/strong>&nbsp;para incrementar el nivel de resiliencia ante las APT.<\/li>\n\n\n\n<li>Transmitir todo el conocimiento generado a los equipos de Blue Team, Threat Hunting y SOC, facilitando su entrenamiento y engrasando su nivel de coordinaci\u00f3n para&nbsp;<strong>responder con eficacia a las amenazas persistentes avanzadas<\/strong>.<\/li>\n<\/ul>\n\n\n\n<p>En definitiva, las&nbsp;<strong>amenazas persistentes avanzadas<\/strong>&nbsp;y los grupos que las dise\u00f1an e implementan han adquirido una creciente relevancia econ\u00f3mica y social en los \u00faltimos a\u00f1os. Estos ataques dirigidos y sofisticados desaf\u00edan las capacidades defensivas de las empresas y las instituciones de todo el mundo.<\/p>\n\n\n\n<p>Por eso, mejorar la resiliencia frente a las amenazas persistentes avanzadas se ha convertido en una prioridad para las organizaciones que desean estar preparadas para&nbsp;<strong>detectar, responder y mitigar estos ataques<\/strong>&nbsp;y sobrevivir a su impacto.<\/p>\n\n\n\n<p>Al fin y al cabo, como escribi\u00f3 John le Carr\u00e9 en El topo: \u00ab\u00bfQu\u00e9 es supervivencia? Una infinita capacidad de sospecha\u00bb.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Los grupos de amenazas persistentes avanzadas buscan acceder a informaci\u00f3n cr\u00edtica y desestabilizar a compa\u00f1\u00edas de sectores cr\u00edticos y administraciones p\u00fablicas La era de los esp\u00edas circunspectos y silenciosos que John le Carr\u00e9 retrat\u00f3 para la posteridad en novelas como&nbsp;El esp\u00eda que surgi\u00f3 el fr\u00edo, termin\u00f3 con el final de la Guerra Fr\u00eda. Hoy en &hellip;<\/p>\n<p class=\"read-more\"> <a class=\"\" href=\"https:\/\/oyshop.com.co\/que-son-las-amenazas-persistentes-avanzadas\/\"> <span class=\"screen-reader-text\">\u00bfQu\u00e9 son las amenazas persistentes avanzadas?<\/span> Leer m\u00e1s &raquo;<\/a><\/p>\n","protected":false},"author":1,"featured_media":959,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_uag_custom_page_level_css":"","site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"narrow-width-container","site-content-style":"unboxed","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"set","footnotes":"","_joinchat":[]},"categories":[34],"tags":[],"jetpack_featured_media_url":"https:\/\/oyshop.com.co\/wp-content\/uploads\/2023\/08\/f.elconfidencial.com_original_148_bef_120_148bef120ac62c31a2541885ecee3751.jpg","uagb_featured_image_src":{"full":["https:\/\/oyshop.com.co\/wp-content\/uploads\/2023\/08\/f.elconfidencial.com_original_148_bef_120_148bef120ac62c31a2541885ecee3751.jpg",1200,900,false],"thumbnail":["https:\/\/oyshop.com.co\/wp-content\/uploads\/2023\/08\/f.elconfidencial.com_original_148_bef_120_148bef120ac62c31a2541885ecee3751-150x150.jpg",150,150,true],"medium":["https:\/\/oyshop.com.co\/wp-content\/uploads\/2023\/08\/f.elconfidencial.com_original_148_bef_120_148bef120ac62c31a2541885ecee3751-300x225.jpg",300,225,true],"medium_large":["https:\/\/oyshop.com.co\/wp-content\/uploads\/2023\/08\/f.elconfidencial.com_original_148_bef_120_148bef120ac62c31a2541885ecee3751-768x576.jpg",768,576,true],"large":["https:\/\/oyshop.com.co\/wp-content\/uploads\/2023\/08\/f.elconfidencial.com_original_148_bef_120_148bef120ac62c31a2541885ecee3751-1024x768.jpg",1024,768,true],"1536x1536":["https:\/\/oyshop.com.co\/wp-content\/uploads\/2023\/08\/f.elconfidencial.com_original_148_bef_120_148bef120ac62c31a2541885ecee3751.jpg",1200,900,false],"2048x2048":["https:\/\/oyshop.com.co\/wp-content\/uploads\/2023\/08\/f.elconfidencial.com_original_148_bef_120_148bef120ac62c31a2541885ecee3751.jpg",1200,900,false],"mailpoet_newsletter_max":["https:\/\/oyshop.com.co\/wp-content\/uploads\/2023\/08\/f.elconfidencial.com_original_148_bef_120_148bef120ac62c31a2541885ecee3751.jpg",1200,900,false],"woocommerce_thumbnail":["https:\/\/oyshop.com.co\/wp-content\/uploads\/2023\/08\/f.elconfidencial.com_original_148_bef_120_148bef120ac62c31a2541885ecee3751-300x300.jpg",300,300,true],"woocommerce_single":["https:\/\/oyshop.com.co\/wp-content\/uploads\/2023\/08\/f.elconfidencial.com_original_148_bef_120_148bef120ac62c31a2541885ecee3751-600x450.jpg",600,450,true],"woocommerce_gallery_thumbnail":["https:\/\/oyshop.com.co\/wp-content\/uploads\/2023\/08\/f.elconfidencial.com_original_148_bef_120_148bef120ac62c31a2541885ecee3751-100x100.jpg",100,100,true]},"uagb_author_info":{"display_name":"oyshopadmin","author_link":"https:\/\/oyshop.com.co\/author\/oyshopadmin\/"},"uagb_comment_info":0,"uagb_excerpt":"Los grupos de amenazas persistentes avanzadas buscan acceder a informaci\u00f3n cr\u00edtica y desestabilizar a compa\u00f1\u00edas de sectores cr\u00edticos y administraciones p\u00fablicas La era de los esp\u00edas circunspectos y silenciosos que John le Carr\u00e9 retrat\u00f3 para la posteridad en novelas como&nbsp;El esp\u00eda que surgi\u00f3 el fr\u00edo, termin\u00f3 con el final de la Guerra Fr\u00eda. Hoy en&hellip;","_links":{"self":[{"href":"https:\/\/oyshop.com.co\/wp-json\/wp\/v2\/posts\/956"}],"collection":[{"href":"https:\/\/oyshop.com.co\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/oyshop.com.co\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/oyshop.com.co\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/oyshop.com.co\/wp-json\/wp\/v2\/comments?post=956"}],"version-history":[{"count":1,"href":"https:\/\/oyshop.com.co\/wp-json\/wp\/v2\/posts\/956\/revisions"}],"predecessor-version":[{"id":960,"href":"https:\/\/oyshop.com.co\/wp-json\/wp\/v2\/posts\/956\/revisions\/960"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/oyshop.com.co\/wp-json\/wp\/v2\/media\/959"}],"wp:attachment":[{"href":"https:\/\/oyshop.com.co\/wp-json\/wp\/v2\/media?parent=956"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/oyshop.com.co\/wp-json\/wp\/v2\/categories?post=956"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/oyshop.com.co\/wp-json\/wp\/v2\/tags?post=956"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}