{"id":1,"date":"2023-08-26T01:55:14","date_gmt":"2023-08-26T06:55:14","guid":{"rendered":"https:\/\/oyshop.com.co\/?p=1"},"modified":"2023-08-30T21:13:40","modified_gmt":"2023-08-31T02:13:40","slug":"seguridad-informatica","status":"publish","type":"post","link":"https:\/\/oyshop.com.co\/seguridad-informatica\/","title":{"rendered":"OWASP SAMM: Evaluar y mejorar la seguridad del software empresarial"},"content":{"rendered":"\n<blockquote class=\"wp-block-quote\">\n<p>OWASP SAMM es un modelo que ayuda a las empresas a evaluar su postura de seguridad de software y poner en marcha una estrategia para optimizarla<\/p>\n<\/blockquote>\n\n\n\n<p>El grupo de ransomware Lace Tempest, c\u00e9lebre por usar Cl0p para realizar extorsiones, ha protagonizado uno de los ciberataques m\u00e1s c\u00e9lebres y da\u00f1inos de 2023, al explotar una&nbsp;<a rel=\"noreferrer noopener\" href=\"https:\/\/www.tarlogic.com\/es\/blog\/cve-2023-34362-vulnerabilidad-moveit-transfer\/\" target=\"_blank\">vulnerabilidad presente en el software MOVEit Transfer<\/a>. Esta soluci\u00f3n permite realizar transferencias de archivos automatizadas para datos confidenciales y es usada por miles de empresas en todo el mundo. De tal forma que los ciberdelincuentes han logrado atacar a compa\u00f1\u00edas energ\u00e9ticas, fondos de pensiones, aseguradoras o administraciones p\u00fablicas en Norteam\u00e9rica y Europa de \u00e1mbitos sensibles como la educaci\u00f3n o la salud.<\/p>\n\n\n\n<p>Este ataque evidencia la necesidad de que las empresas y las instituciones cuenten con una estrategia de seguridad eficaz para proteger el software empresarial a lo largo de su ciclo de vida<\/p>\n\n\n\n<p>Por eso, la&nbsp;<a rel=\"noreferrer noopener\" href=\"https:\/\/owasp.org\/\" target=\"_blank\">Fundaci\u00f3n OWASP<\/a>&nbsp;cre\u00f3 en 2009 un modelo de madurez de seguridad del software, conocido por sus siglas en ingl\u00e9s: SAMM. Este modelo permite a las organizaciones analizar sus pr\u00e1cticas de seguridad del software y las ayuda a construir un programa de seguridad para optimizarlas, incrementando, as\u00ed, el nivel de protecci\u00f3n del software empresarial.<\/p>\n\n\n\n<p>A continuaci\u00f3n, vamos a diseccionar las claves de&nbsp;<strong>OWASP SAMM<\/strong>&nbsp;y c\u00f3mo los servicios de ciberseguridad avanzados pueden ayudar a las empresas a mejorar su postura de seguridad del software, de acuerdo a las funciones, pr\u00e1cticas, actividades y niveles del modelo.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">1. Qu\u00e9 es OWASP SAMM y c\u00f3mo se puede usar<\/h2>\n\n\n\n<p><strong>OWASP SAMM es un framework a disposici\u00f3n de todas las empresas y administraciones p\u00fablicas para evaluar, dise\u00f1ar e implementar una estrategia de seguridad del software<\/strong>. El modelo ha sido dise\u00f1ado de forma abierta, de cara a garantizar que se puede adaptar a cualquier contexto. As\u00ed,&nbsp;<strong>OWASP SAMM<\/strong>&nbsp;no est\u00e1 pensado solo para ser empleado por las compa\u00f1\u00edas que desarrollan software, sino tambi\u00e9n para aquellas que lo contratan o adquieren.<\/p>\n\n\n\n<p>Adem\u00e1s, se trata de una herramienta que se puede usar si la organizaci\u00f3n ha adoptado el enfoque DevSecOps para securizar el software desde el dise\u00f1o y a lo largo de todo su ciclo de vida.<\/p>\n\n\n\n<p>A trav\u00e9s de SAMM, las empresas peque\u00f1as, medianas y grandes pueden analizar sus actuales pr\u00e1cticas de seguridad, definir un plan de mejora y evaluar su implementaci\u00f3n. De ah\u00ed que OWASP se\u00f1ale cuatro usos pr\u00e1cticos de SAMM:<\/p>\n\n\n\n<ul>\n<li>Evaluar la postura de seguridad del software actual de una organizaci\u00f3n.<\/li>\n\n\n\n<li>Establecer la estrategia de seguridad de la organizaci\u00f3n en funci\u00f3n de los objetivos que se persiguen.<\/li>\n\n\n\n<li>Dise\u00f1ar un plan de acci\u00f3n para alcanzar los objetivos, incluyendo las actividades que se deben llevar a cabo.<\/li>\n\n\n\n<li>Asesorar a las organizaciones a la hora de implementar algunas actividades.<\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\">1.1. Puesta en marcha<\/h2>\n\n\n\n<p>Para comenzar a trabajar con SAMM, OWASP recomienda seguir seis pasos b\u00e1sicos:<\/p>\n\n\n\n<ol>\n<li><strong>Preparaci\u00f3n<\/strong>. En esta fase se ha de establecer el target, es decir, si se buscar mejorar la seguridad de una aplicaci\u00f3n concreta, de un \u00e1rea determinada o de toda la organizaci\u00f3n. Adem\u00e1s, es fundamental identificar a todas las organizaciones terceras involucradas, como los proveedores de software, y asegurarse de que est\u00e1n alineadas con la estrategia de seguridad.<\/li>\n\n\n\n<li><strong>Evaluaci\u00f3n<\/strong>. Se&nbsp;<strong>usa OWASP SAMM para evaluar las pr\u00e1cticas de seguridad actuales<\/strong>&nbsp;y determinar el nivel de madurez que se busca alcanzar en cada pr\u00e1ctica de seguridad del modelo.<\/li>\n\n\n\n<li><strong>Establecimiento de los objetivos<\/strong>. El tercer paso gira en torno al establecimiento de los objetivos a conseguir. Para ello, la compa\u00f1\u00eda debe fijar las actividades de seguridad que debe llevar a cabo, teniendo en cuenta la coherencia entre ellas y los recursos econ\u00f3micos disponibles, precisando a cu\u00e1nto asciende el presupuesto destinado a optimizar la estrategia de seguridad del software.<\/li>\n\n\n\n<li><strong>Planificaci\u00f3n<\/strong>. Es fundamental planificar la estrategia para mejorar la postura de seguridad de la organizaci\u00f3n, incluyendo fases y plazos y distribuyendo las actividades, teniendo en cuenta los recursos disponibles y el esfuerzo que requiere cada actividad.<\/li>\n\n\n\n<li><strong>Implementaci\u00f3n<\/strong>. En la pen\u00faltima fase de implementan las actividades en funci\u00f3n del calendario elaborado durante la planificaci\u00f3n. Es importante tener en cuenta su impacto en los procesos, las personas y las herramientas de la compa\u00f1\u00eda.<\/li>\n\n\n\n<li><strong>Despliegue<\/strong>. Finalmente, hay que medir la eficacia de las medidas implementadas y su impacto en la organizaci\u00f3n.<\/li>\n<\/ol>\n\n\n\n<p>\u00bfHan de ejecutarse todas las fases? No, depender\u00e1 del uso que se le quiera dar al modelo. Por ejemplo, si solo se emplea&nbsp;<strong>OWASP SAMM<\/strong>&nbsp;para evaluar la postura de seguridad de la compa\u00f1\u00eda, bastar\u00e1 con implementar los dos primeros pasos.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">2. Estructura de OWASP SAMM<\/h2>\n\n\n\n<p>Para entender c\u00f3mo funciona el SAMM y c\u00f3mo se puede usar de forma pr\u00e1ctica para mejorar la seguridad del software empresariales es importante abordar la estructura del modelo, que gira en torno a cinco grandes elementos:<\/p>\n\n\n\n<ol>\n<li>Funciones de negocio.<\/li>\n\n\n\n<li>Pr\u00e1cticas de seguridad.<\/li>\n\n\n\n<li>Flujos.<\/li>\n\n\n\n<li>Niveles de madurez.<\/li>\n\n\n\n<li>Actividades.<\/li>\n<\/ol>\n\n\n\n<h2 class=\"wp-block-heading\">2.1. Funciones de negocio y pr\u00e1cticas de seguridad<\/h2>\n\n\n\n<p><strong>OWASP SAMM<\/strong>&nbsp;se estructura en forma de \u00e1rbol. El tronco de este \u00e1rbol lo conforman cinco funciones de negocio:<\/p>\n\n\n\n<ol>\n<li><strong>Gobernanza (G)<\/strong>. Esta funci\u00f3n engloba los procesos relacionados con la gesti\u00f3n de las actividades de desarrollo de software, su impacto en la organizaci\u00f3n y los procesos empresariales.<\/li>\n\n\n\n<li><strong>Dise\u00f1o (D)<\/strong>. La segunda funci\u00f3n de SAMM presta atenci\u00f3n a las actuaciones que se realizan dentro de los proyectos de desarrollo de software, a los requisitos de seguridad y a la arquitectura de las aplicaciones.<\/li>\n\n\n\n<li><strong>Implementaci\u00f3n (I)<\/strong>. Engloba todos los procesos relacionados con la construcci\u00f3n y el despliegue de los componentes de software, prestando especial atenci\u00f3n a sus defectos. Las actividades que forman parte de esta funci\u00f3n tienen como objetivo distribuir software fiable y con los m\u00ednimos defectos.<\/li>\n\n\n\n<li><strong>Verificaci\u00f3n (V)<\/strong>. Gira en torno a la prueba y comprobaci\u00f3n del software a lo largo de su ciclo de vida. En este sentido, juegan un papel fundamental las pruebas de seguridad de aplicaciones.<\/li>\n\n\n\n<li><strong>Operaciones (O)<\/strong>. Las actividades de esta funci\u00f3n deben garantizar la confidencialidad, integridad y disponibilidad de los datos durante toda la vida de las aplicaciones.<\/li>\n<\/ol>\n\n\n\n<p>Estas cinco funciones cuentan, cada una de ellas, con tres pr\u00e1cticas de seguridad asociadas. De tal forma que&nbsp;<strong>OWASP SAMM es un modelo conformado por 15 pr\u00e1cticas de seguridad<\/strong>&nbsp;a tener en cuenta en la securizaci\u00f3n del software empresarial.<\/p>\n\n\n\n<ul>\n<li>Estrategia y m\u00e9tricas (G).<\/li>\n\n\n\n<li>Pol\u00edtica y cumplimiento (G).<\/li>\n\n\n\n<li>Formaci\u00f3n y orientaci\u00f3n (G).<\/li>\n\n\n\n<li>Evaluaci\u00f3n de amenazas (D).<\/li>\n\n\n\n<li>Requisitos de seguridad (D).<\/li>\n\n\n\n<li>Arquitectura de seguridad (D).<\/li>\n\n\n\n<li>Construcci\u00f3n segura (I).<\/li>\n\n\n\n<li>Implantaci\u00f3n segura (I).<\/li>\n\n\n\n<li>Gesti\u00f3n de fallos (I).<\/li>\n\n\n\n<li>Evaluaci\u00f3n de la arquitectura (V).<\/li>\n\n\n\n<li>Pruebas basadas en requisitos (V).<\/li>\n\n\n\n<li>Pruebas de seguridad (V).<\/li>\n\n\n\n<li>Gesti\u00f3n de incidentes (O).<\/li>\n\n\n\n<li>Gesti\u00f3n del entorno (O).<\/li>\n\n\n\n<li>Gesti\u00f3n operativa (O).<\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\">2.2. Flujos, niveles de madurez y actividades que se deben realizar<\/h2>\n\n\n\n<p>Todas las pr\u00e1cticas de seguridad que venimos de enumerar se dividen, a su vez, en dos flujos que incluyen tres actividades diferentes, en funci\u00f3n del nivel de madurez de la organizaci\u00f3n. Por ejemplo, la pr\u00e1ctica de seguridad denominada Implantaci\u00f3n segura se divide en dos flujos que contienen tres actividades diferentes, en funci\u00f3n del nivel de madurez que busca alcanzar la organizaci\u00f3n:<\/p>\n\n\n\n<h4 class=\"wp-block-heading\">1. Proceso de implantaci\u00f3n<\/h4>\n\n\n\n<ul>\n<li><strong>Nivel 1<\/strong>. Formalizar el proceso de implantaci\u00f3n y securizar las herramientas y procesos usados.<\/li>\n\n\n\n<li><strong>Nivel 2<\/strong>. Automatizar el proceso de implantaci\u00f3n en todas sus fases e introducir pruebas de verificaci\u00f3n de seguridad.<\/li>\n\n\n\n<li><strong>Nivel 3<\/strong>. Verificar autom\u00e1ticamente la integridad de todo el software desplegado, sin importar si se ha desarrollado de forma interna o externa.<\/li>\n<\/ul>\n\n\n\n<h4 class=\"wp-block-heading\">2. Gesti\u00f3n de los secretos<\/h4>\n\n\n\n<ul>\n<li><strong>Nivel 1<\/strong>. Poner en marcha medidas de protecci\u00f3n b\u00e1sicas, con el objetivo de limitar el acceso a los secretos de producci\u00f3n del software.<\/li>\n\n\n\n<li><strong>Nivel 2<\/strong>. Inyectar secretos durante el proceso de despliegue desde almacenes reforzados. As\u00ed como auditar todos los accesos a ellos.<\/li>\n\n\n\n<li><strong>Nivel 3<\/strong>. Optimizar el ciclo de vida de los secretos de software, garantizando su uso adecuado.<\/li>\n<\/ul>\n\n\n\n<p>Esta estructura se repite con las otras 14 pr\u00e1cticas de seguridad. De tal forma que&nbsp;<strong>OWASP SAMM propone hasta 90 actividades<\/strong>&nbsp;que se pueden llevar a cabo para mejorar la postura de seguridad del software de una compa\u00f1\u00eda o administraci\u00f3n p\u00fablica.<\/p>\n\n\n\n<figure class=\"wp-block-image size-large is-resized\"><img loading=\"lazy\" decoding=\"async\" src=\"https:\/\/oyshop.com.co\/wp-content\/uploads\/2023\/08\/consejos-ciberseguridad-contra-las-amenazas-de-la-red-1024x683.jpg\" alt=\"\" class=\"wp-image-919\" style=\"width:697px;height:465px\" width=\"697\" height=\"465\" srcset=\"https:\/\/oyshop.com.co\/wp-content\/uploads\/2023\/08\/consejos-ciberseguridad-contra-las-amenazas-de-la-red-1024x683.jpg 1024w, https:\/\/oyshop.com.co\/wp-content\/uploads\/2023\/08\/consejos-ciberseguridad-contra-las-amenazas-de-la-red-300x200.jpg 300w, https:\/\/oyshop.com.co\/wp-content\/uploads\/2023\/08\/consejos-ciberseguridad-contra-las-amenazas-de-la-red-768x512.jpg 768w, https:\/\/oyshop.com.co\/wp-content\/uploads\/2023\/08\/consejos-ciberseguridad-contra-las-amenazas-de-la-red-1320x880.jpg 1320w, https:\/\/oyshop.com.co\/wp-content\/uploads\/2023\/08\/consejos-ciberseguridad-contra-las-amenazas-de-la-red-600x400.jpg 600w, https:\/\/oyshop.com.co\/wp-content\/uploads\/2023\/08\/consejos-ciberseguridad-contra-las-amenazas-de-la-red.jpg 1500w\" sizes=\"(max-width: 697px) 100vw, 697px\" \/><\/figure>\n\n\n\n<div style=\"height:29px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<h4 class=\"wp-block-heading\">2.2.1. La importancia de los niveles<\/h4>\n\n\n\n<p>\u00bfQuiere decir esto que todas las empresas deben poner en marcha una estrategia para implementar las 90 actividades? No. Por eso&nbsp;<strong>OWASP SAMM<\/strong>&nbsp;incluye los niveles de madurez. Puesto que no todas las empresas est\u00e1n sometidas al mismo nivel de ciberexposici\u00f3n ni tienen que hacer frente a los mismos riesgos.<\/p>\n\n\n\n<p>Al fin y al cabo, resulta evidente que una multinacional que opera en un sector cr\u00edtico como las finanzas o la energ\u00eda y una pyme cuya actividad econ\u00f3mica no es cr\u00edtica para el funcionamiento de la sociedad y el mercado, no disponen de los mismos recursos, pero tampoco est\u00e1n obligadas a cumplir los mismos requisitos normativos, ni tienen necesidades y objetivos de seguridad an\u00e1logos.<\/p>\n\n\n\n<p>Por ello, OWASP incluy\u00f3 los niveles de madurez, para ayudar a las empresas, sin importar su tama\u00f1o o sector econ\u00f3mico, a evaluar sus pr\u00e1cticas de seguridad y trazar estrategias para incrementar el nivel de madurez en aquellas pr\u00e1cticas clave para la organizaci\u00f3n, en funci\u00f3n de los recursos y presupuesto disponibles.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">3. C\u00f3mo evaluar la postura de seguridad y la eficacia de las acciones implementadas<\/h2>\n\n\n\n<p><strong>Las evaluaciones son un elemento fundamental del OWASP SAMM<\/strong>, puesto que gracias al modelo una organizaci\u00f3n puede medir la efectividad de sus pr\u00e1cticas de seguridad actuales y fijar una hoja de ruta por fases para mejorar los resultados actuales.<\/p>\n\n\n\n<p>Usar SAMM para realizar evaluaciones es una pr\u00e1ctica muy sencilla y se basa en la cumplimentaci\u00f3n de una entrevista.<\/p>\n\n\n\n<p>El modelo formula una pregunta para cada una de las 90 actividades que lo conforman. A cada pregunta se puede responder con una de las cuatro respuestas predefinidas. Para facilitar la tarea de respuesta,&nbsp;<strong>OWASP SAMM<\/strong>&nbsp;incluye una serie de criterios de calidad para cada pregunta.<\/p>\n\n\n\n<p>Por ejemplo, la primera pregunta de la funci\u00f3n Gobernanza es \u00ab\u00bfConoce la cantidad de riesgo que est\u00e1 dispuesta a asumir toda la compa\u00f1\u00eda en lo relativo a sus aplicaciones de software?\u00bb. Los criterios de calidad que se ofrecen como gu\u00eda son:<\/p>\n\n\n\n<ul>\n<li>Es posible conocer el nivel de riesgo que quieren asumir los directivos de la compa\u00f1\u00eda.<\/li>\n\n\n\n<li>La direcci\u00f3n de la empresa examina y aprueba los riesgos de software.<\/li>\n\n\n\n<li>Se pueden identificar las principales amenazas empresariales y t\u00e9cnicas para los activos de la compa\u00f1\u00eda y sus datos.<\/li>\n\n\n\n<li>Los riesgos pueden documentarse y guardarse en un lugar accesible y seguro.<\/li>\n<\/ul>\n\n\n\n<p>Sirvi\u00e9ndose de estos criterios de calidad, la persona que est\u00e9 cumplimentando la entrevista puede responder:<\/p>\n\n\n\n<ul>\n<li>No. Si los criterios no se cumplen en su totalidad.<\/li>\n\n\n\n<li>S\u00ed, se cubren los riesgos generales.<\/li>\n\n\n\n<li>S\u00ed, se cubren los riesgos espec\u00edficos de la organizaci\u00f3n.<\/li>\n\n\n\n<li>S\u00ed, se cubren riegos y oportunidades.<\/li>\n<\/ul>\n\n\n\n<h3 class=\"wp-block-heading\">3.1. Transformar respuestas cualitativas en calificaciones cuantitativas<\/h3>\n\n\n\n<p>Para llevar a cabo las evaluaciones y facilitar el dise\u00f1o de una estrategia de seguridad que mejore la postura de seguridad del software, OWASP pone a disposici\u00f3n de las empresas herramientas en formato Microsoft Excel y Google Spreadsheet. Adem\u00e1s, las compa\u00f1\u00edas pueden dise\u00f1ar sus propias herramientas de evaluaci\u00f3n online o hacer uso de SAMMY, una soluci\u00f3n creada por Codific.<\/p>\n\n\n\n<p>Estas herramientas facilitan la tarea de transformar las respuestas a las&nbsp;<strong>90 preguntas de OWASP SAMM<\/strong>&nbsp;en una puntuaci\u00f3n que representa el nivel de madurez de una organizaci\u00f3n en lo relativo a las diferentes pr\u00e1cticas de seguridad, pero tambi\u00e9n a las funciones de negocio.<\/p>\n\n\n\n<p>As\u00ed, la puntuaci\u00f3n puede ir del 0 al 3, que representa el m\u00e1ximo nivel de madurez. Como ya se\u00f1alamos antes, no todas las empresas deben aspirar a alcanzar esta puntuaci\u00f3n en cada pr\u00e1ctica de seguridad, sino que, debe ir en consonancia con las necesidades, objetivos y recursos empresariales.<\/p>\n\n\n\n<p>Por ello, a partir de la puntuaci\u00f3n inicial, las organizaciones pueden fijarse como objetivo alcanzar puntuaciones m\u00e1s elevadas en un futuro, planificando el proceso de optimizaci\u00f3n de la estrategia de seguridad del software en diferentes fases, de cara a lograr implementar con \u00e9xito las actividades contempladas en el modelo.<\/p>\n\n\n\n<p>\u00bfC\u00f3mo se comprueba que el programa de seguridad se est\u00e1 implementando de forma id\u00f3nea y se cumplen los objetivos de cada fase? Volviendo a realizar la&nbsp;<strong>evaluaci\u00f3n mediante OWASP SAMM<\/strong>.<\/p>\n\n\n\n<p><a href=\"https:\/\/www.tarlogic.com\/wp-content\/uploads\/2023\/08\/seguridad-software-3.webp\"><\/a><\/p>\n\n\n\n<figure class=\"wp-block-image size-large is-resized\"><img loading=\"lazy\" decoding=\"async\" src=\"https:\/\/oyshop.com.co\/wp-content\/uploads\/2023\/08\/blog-ciber-1024x576.jpg\" alt=\"\" class=\"wp-image-920\" style=\"object-fit:cover;width:697px;height:474px\" width=\"697\" height=\"474\"\/><\/figure>\n\n\n\n<div style=\"height:25px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<h2 class=\"wp-block-heading\">4. Servicios de ciberseguridad para proteger el software en todo su ciclo de vida<\/h2>\n\n\n\n<p>Las claves de&nbsp;<strong>OWASP SAMM<\/strong>&nbsp;que hemos ido desgranando en este art\u00edculo ponen en valor la necesidad de que las empresas que deseen fortalecer la seguridad del software empresarial cuenten con servicios de ciberseguridad avanzados en las cinco grandes funciones de negocio y en las 15 pr\u00e1cticas de seguridad que las conforman.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">4.1. M\u00faltiples servicios para optimizar todas las funciones de negocio<\/h3>\n\n\n\n<ul>\n<li><strong>Gobernanza<\/strong>. El asesoramiento integral en materia de ciberseguridad para gestionar con eficacia las capacidades defensivas, cumplir con los requisitos normativos y formar a los profesionales de una organizaci\u00f3n para que lleven a cabo buenas pr\u00e1cticas es crucial.<\/li>\n\n\n\n<li><strong>Dise\u00f1o<\/strong>. Realizar evaluaciones de amenazas del software propio y de las aplicaciones y componentes de terceros y auditor\u00edas de c\u00f3digo, as\u00ed como establecer pr\u00e1cticas y requisitos de seguridad eficaces a la hora de dise\u00f1ar el software y gestionar los activos tecnol\u00f3gicos.<\/li>\n\n\n\n<li><strong>Implementaci\u00f3n<\/strong>. Monitorear de forma continua el software y los componentes de terceros para detectar vulnerabilidades antes de que sean explotadas por actores hostiles. Son fundamentales tanto el servicio de gesti\u00f3n de vulnerabilidades como la detecci\u00f3n de vulnerabilidades emergentes.<\/li>\n\n\n\n<li><strong>Verificaci\u00f3n<\/strong>. Llevar a cabo pruebas de seguridad de aplicaciones (DAST, SAST, SCA, SCS\u2026) de manera permanente para detectar fallos y vulnerabilidades que puedan dar lugar a incidentes de seguridad.<\/li>\n\n\n\n<li><strong>Operaciones<\/strong>. Las empresas deben disponer de mecanismos de seguridad para detectar incidentes de seguridad, responder y mitigar las actuaciones maliciosas, de cara a garantizar la continuidad de negocio y la protecci\u00f3n de los datos.<\/li>\n<\/ul>\n\n\n\n<p>En definitiva,&nbsp;<strong>OWASP SAMM es una metodolog\u00eda abierta<\/strong>, que se adapta al contexto de cualquier organizaci\u00f3n y que sirve para evaluar la postura de seguridad del software, as\u00ed como para dise\u00f1ar un plan de acci\u00f3n y una hoja de ruta para mejorarla.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>OWASP SAMM es un modelo que ayuda a las empresas a evaluar su postura de seguridad de software y poner en marcha una estrategia para optimizarla El grupo de ransomware Lace Tempest, c\u00e9lebre por usar Cl0p para realizar extorsiones, ha protagonizado uno de los ciberataques m\u00e1s c\u00e9lebres y da\u00f1inos de 2023, al explotar una&nbsp;vulnerabilidad presente &hellip;<\/p>\n<p class=\"read-more\"> <a class=\"\" href=\"https:\/\/oyshop.com.co\/seguridad-informatica\/\"> <span class=\"screen-reader-text\">OWASP SAMM: Evaluar y mejorar la seguridad del software empresarial<\/span> Leer m\u00e1s &raquo;<\/a><\/p>\n","protected":false},"author":1,"featured_media":924,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_uag_custom_page_level_css":"","site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"narrow-width-container","site-content-style":"unboxed","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"set","footnotes":"","_joinchat":[]},"categories":[30],"tags":[],"jetpack_featured_media_url":"https:\/\/oyshop.com.co\/wp-content\/uploads\/2023\/08\/ciberseguridad-espana-2.jpg","uagb_featured_image_src":{"full":["https:\/\/oyshop.com.co\/wp-content\/uploads\/2023\/08\/ciberseguridad-espana-2.jpg",1400,600,false],"thumbnail":["https:\/\/oyshop.com.co\/wp-content\/uploads\/2023\/08\/ciberseguridad-espana-2-150x150.jpg",150,150,true],"medium":["https:\/\/oyshop.com.co\/wp-content\/uploads\/2023\/08\/ciberseguridad-espana-2-300x129.jpg",300,129,true],"medium_large":["https:\/\/oyshop.com.co\/wp-content\/uploads\/2023\/08\/ciberseguridad-espana-2-768x329.jpg",768,329,true],"large":["https:\/\/oyshop.com.co\/wp-content\/uploads\/2023\/08\/ciberseguridad-espana-2-1024x439.jpg",1024,439,true],"1536x1536":["https:\/\/oyshop.com.co\/wp-content\/uploads\/2023\/08\/ciberseguridad-espana-2.jpg",1400,600,false],"2048x2048":["https:\/\/oyshop.com.co\/wp-content\/uploads\/2023\/08\/ciberseguridad-espana-2.jpg",1400,600,false],"mailpoet_newsletter_max":["https:\/\/oyshop.com.co\/wp-content\/uploads\/2023\/08\/ciberseguridad-espana-2-1320x566.jpg",1320,566,true],"woocommerce_thumbnail":["https:\/\/oyshop.com.co\/wp-content\/uploads\/2023\/08\/ciberseguridad-espana-2-300x300.jpg",300,300,true],"woocommerce_single":["https:\/\/oyshop.com.co\/wp-content\/uploads\/2023\/08\/ciberseguridad-espana-2-600x257.jpg",600,257,true],"woocommerce_gallery_thumbnail":["https:\/\/oyshop.com.co\/wp-content\/uploads\/2023\/08\/ciberseguridad-espana-2-100x100.jpg",100,100,true]},"uagb_author_info":{"display_name":"oyshopadmin","author_link":"https:\/\/oyshop.com.co\/author\/oyshopadmin\/"},"uagb_comment_info":7,"uagb_excerpt":"OWASP SAMM es un modelo que ayuda a las empresas a evaluar su postura de seguridad de software y poner en marcha una estrategia para optimizarla El grupo de ransomware Lace Tempest, c\u00e9lebre por usar Cl0p para realizar extorsiones, ha protagonizado uno de los ciberataques m\u00e1s c\u00e9lebres y da\u00f1inos de 2023, al explotar una&nbsp;vulnerabilidad presente&hellip;","_links":{"self":[{"href":"https:\/\/oyshop.com.co\/wp-json\/wp\/v2\/posts\/1"}],"collection":[{"href":"https:\/\/oyshop.com.co\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/oyshop.com.co\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/oyshop.com.co\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/oyshop.com.co\/wp-json\/wp\/v2\/comments?post=1"}],"version-history":[{"count":7,"href":"https:\/\/oyshop.com.co\/wp-json\/wp\/v2\/posts\/1\/revisions"}],"predecessor-version":[{"id":934,"href":"https:\/\/oyshop.com.co\/wp-json\/wp\/v2\/posts\/1\/revisions\/934"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/oyshop.com.co\/wp-json\/wp\/v2\/media\/924"}],"wp:attachment":[{"href":"https:\/\/oyshop.com.co\/wp-json\/wp\/v2\/media?parent=1"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/oyshop.com.co\/wp-json\/wp\/v2\/categories?post=1"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/oyshop.com.co\/wp-json\/wp\/v2\/tags?post=1"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}