{"id":952,"date":"2023-08-30T21:35:05","date_gmt":"2023-08-31T02:35:05","guid":{"rendered":"https:\/\/oyshop.com.co\/?p=952"},"modified":"2023-08-30T22:08:18","modified_gmt":"2023-08-31T03:08:18","slug":"ssvc-como-tomar-decisiones-sobre-las-vulnerabilidades-it","status":"publish","type":"post","link":"https:\/\/oyshop.com.co\/ssvc-como-tomar-decisiones-sobre-las-vulnerabilidades-it\/","title":{"rendered":"SSVC: C\u00f3mo tomar decisiones sobre las vulnerabilidades IT"},"content":{"rendered":"\n<blockquote class=\"wp-block-quote\">\n<p>SSVC es un sistema que ayuda a analizar las vulnerabilidades para tomar decisiones que contribuyan a prevenir incidentes de seguridad y contener sus consecuencias<\/p>\n<\/blockquote>\n\n\n\n<p>La BBC, British Airways, el Departamento de Energ\u00eda de Estados Unidos, PwC o Shell son algunas de las&nbsp;<a href=\"https:\/\/www.theguardian.com\/technology\/2023\/jun\/16\/moveit-transfer-hack-department-of-energy\" target=\"_blank\" rel=\"noreferrer noopener\">organizaciones afectadas<\/a>&nbsp;por la explotaci\u00f3n exitosa de una vulnerabilidad presente en el software de transferencia de archivos MoveIt. Estas compa\u00f1\u00edas y administraciones p\u00fablicas han tenido que hacer frente a una brecha de datos y el robo de informaci\u00f3n confidencial de clientes y trabajadores. Este ataque masivo pone de manifiesto la importancia de&nbsp;<strong>detectar, analizar y mitigar las vulnerabilidades IT<\/strong>&nbsp;presentes en la infraestructura de las compa\u00f1\u00edas.<\/p>\n\n\n\n<p>Para ayudarlas en esta compleja tarea, las empresas, instituciones p\u00fablicas y compa\u00f1\u00edas de ciberseguridad cuentan a su disposici\u00f3n con indicadores como&nbsp;<strong>CVSS<\/strong>,&nbsp;<strong>EPSS<\/strong>&nbsp;o&nbsp;<strong>SSVC<\/strong>. Este \u00faltimo sistema, creado por la Cybersecurity &amp; Infraestructure Security Agency de Estados Unidos (<a href=\"https:\/\/www.cisa.gov\/stakeholder-specific-vulnerability-categorization-ssvc\" target=\"_blank\" rel=\"noreferrer noopener\">CISA<\/a>), en colaboraci\u00f3n con la Carnegie Mellon University, una de las mejores universidades del mundo en el terreno de la ingenier\u00eda, busca&nbsp;<strong>facilitar la toma de decisiones sobre las vulnerabilidades<\/strong>. De tal forma que las organizaciones sean capaces de determinar cu\u00e1ndo deben:<\/p>\n\n\n\n<ul>\n<li>Rastrear una vulnerabilidad.<\/li>\n\n\n\n<li>Monitorearla de cerca.<\/li>\n\n\n\n<li>Prestar atenci\u00f3n, involucrando a personal interno, solicitando la ayuda de especialistas y procediendo a mitigarla antes de los plazos de actualizaci\u00f3n est\u00e1ndar.<\/li>\n\n\n\n<li>Actuar para&nbsp;<strong>remediar la vulnerabilidad<\/strong>&nbsp;lo antes posible.<\/li>\n<\/ul>\n\n\n\n<p>En este art\u00edculo, vamos a explorar las&nbsp;<strong>claves del sistema SSVC<\/strong>&nbsp;para desentra\u00f1ar por qu\u00e9 puede ser \u00fatil para tomar decisiones relativas a la&nbsp;<a href=\"https:\/\/www.tarlogic.com\/es\/infraestructuras-it-gestion-vulnerabilidades\/\" target=\"_blank\" rel=\"noreferrer noopener\"><strong>gesti\u00f3n de vulnerabilidades en infraestructuras IT<\/strong><\/a>.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">1. SSVC, datos cualitativos para gestionar las vulnerabilidades IT<\/h2>\n\n\n\n<p>Comencemos por el principio, \u00bfqu\u00e9 significan las siglas&nbsp;<strong>SSVC<\/strong>? Stakeholder-Specific Vulnerability Categorization. Es decir,&nbsp;<strong>categorizaci\u00f3n de vulnerabilidades espec\u00edficas de las partes interesadas<\/strong>. El propio concepto nos permite vislumbrar una caracter\u00edstica fundamental de SSVC: su objetivo es evaluar las vulnerabilidades poniendo el foco en c\u00f3mo su explotaci\u00f3n exitosa puede impactar en una empresa o en una administraci\u00f3n p\u00fablica concreta, para, as\u00ed, proceder a&nbsp;<strong>priorizar la mitigaci\u00f3n<\/strong>&nbsp;de las diferentes vulnerabilidades.<\/p>\n\n\n\n<p>Detr\u00e1s de las siglas&nbsp;<strong>SSVC<\/strong>&nbsp;se esconde, tambi\u00e9n, un concepto clave para entender esta herramienta: las partes interesadas.<\/p>\n\n\n\n<p><strong>SSVC<\/strong>&nbsp;destaca tres grandes grupos de actores: proveedores que desarrollan los parches, empresas que adquieren software y deben aplicar los parches de seguridad para proteger su infraestructura IT, coordinadores de las acciones de remediaci\u00f3n. En funci\u00f3n de la posici\u00f3n en la&nbsp;<strong>cadena de suministro de software<\/strong>, una misma empresa puede ser o bien proveedor o bien aplicador. E, incluso, en caso de que una organizaci\u00f3n use software propio, conviven los dos perfiles dentro de la misma compa\u00f1\u00eda.<\/p>\n\n\n\n<p>Asimismo, seg\u00fan la CISA, el&nbsp;<strong>sistema SSVC para analizar las vulnerabilidades IT<\/strong>&nbsp;se asienta sobre tres pilares b\u00e1sicos:<\/p>\n\n\n\n<ol>\n<li>El estado de explotaci\u00f3n de una vulnerabilidad.<\/li>\n\n\n\n<li>El impacto en la seguridad de una explotaci\u00f3n exitosa.<\/li>\n\n\n\n<li>La&nbsp;<strong>prevalencia del activo IT afectado<\/strong>&nbsp;en un sistema empresarial concreto.<\/li>\n<\/ol>\n\n\n\n<p>Estos tres pilares se trasladar\u00e1n a los puntos de decisi\u00f3n que nos permiten determinar&nbsp;<strong>c\u00f3mo se gestiona cada vulnerabilidad en un momento determinado<\/strong>.<\/p>\n\n\n\n<p>Al igual que el Forum of Incident Response and Security Teams (FIRST) ha desarrollado calculadoras para ayudar a las empresas a usar sus indicadores CVSS y EPSS, CISA ha creado una&nbsp;<a href=\"https:\/\/www.cisa.gov\/ssvc-calculator\" target=\"_blank\" rel=\"noreferrer noopener\">calculadora<\/a>&nbsp;que permite a las compa\u00f1\u00edas y administraciones p\u00fablicas tomar una serie de decisiones para dilucidar c\u00f3mo gestionar la vulnerabilidad: rastre\u00e1ndola, monitore\u00e1ndola, prest\u00e1ndole atenci\u00f3n y solicitando asistencia o actuando lo m\u00e1s r\u00e1pido posible.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">2. Los puntos de decisi\u00f3n que marcan la toma de decisiones<\/h2>\n\n\n\n<p>Mientras que en&nbsp;<strong>CVSS<\/strong>&nbsp;es necesario estipular un valor para cada vector que conforman las m\u00e9tricas del indicador, en el caso de&nbsp;<strong>SSVC<\/strong>&nbsp;hay que elegir un valor para cada uno de los cuatro nodos del \u00e1rbol de toma de decisiones. El valor que se escoja en cada punto de decisi\u00f3n sirve para configurar la rama del \u00e1rbol o el vector SSVC, la representaci\u00f3n gr\u00e1fica de todos los valores escogidos a lo largo del proceso. El objetivo final es ayudar a una organizaci\u00f3n a&nbsp;<strong>decidir c\u00f3mo actuar con respecto a una vulnerabilidad presente en su infraestructura IT<\/strong>.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">2.1. Explotaci\u00f3n<\/h3>\n\n\n\n<p>El primer punto de decisi\u00f3n de SSVC es el&nbsp;<strong>estado de explotaci\u00f3n actual de la vulnerabilidad<\/strong>&nbsp;que se est\u00e1 analizando. A diferencia del indicador EPSS, SSVC no predice la probabilidad de explotaci\u00f3n de la vulnerabilidad en el corto plazo, sino que se limita a analizar la informaci\u00f3n que se dispone sobre la&nbsp;<strong>capacidad de explotaci\u00f3n de los actores maliciosos<\/strong>. Para ello, la organizaci\u00f3n debe emplear fuentes de informaci\u00f3n p\u00fablicas, como la National Vulnerability Database (NVD), pero tambi\u00e9n&nbsp;<strong>servicios de Threat Intelligence<\/strong>&nbsp;para detectar la explotaci\u00f3n efectiva de la vulnerabilidad.<\/p>\n\n\n\n<p>En este punto de decisi\u00f3n&nbsp;<strong>SSVC<\/strong>, las organizaciones deben escoger entre tres valores:<\/p>\n\n\n\n<ul>\n<li>Ninguna. No existe evidencia de que se haya producido la explotaci\u00f3n de la vulnerabilidad, ni de una prueba de concepto p\u00fablica para explotarla.<\/li>\n\n\n\n<li>Prueba de concepto. Para escoger este valor, debe cumplirse alguno de los siguientes criterios:\n<ul>\n<li>Se han detectado pruebas de explotaci\u00f3n privadas, que a\u00fan no han sido compartidas p\u00fablicamente.<\/li>\n\n\n\n<li>Existen rumores en el \u00e1mbito de la ciberseguridad sobre la explotaci\u00f3n de esta vulnerabilidad.<\/li>\n\n\n\n<li>Se han encontrado pruebas de concepto en espacios como Metasploit.<\/li>\n\n\n\n<li>La metodolog\u00eda para explotar la vulnerabilidad es conocida.<\/li>\n<\/ul>\n<\/li>\n\n\n\n<li>Activa. Se han recopilado pruebas fiables sobre la explotaci\u00f3n de la vulnerabilidad por parte de actores hostiles y\/o hay informes p\u00fablicos al respecto.<\/li>\n<\/ul>\n\n\n\n<figure class=\"wp-block-image size-full is-resized\"><img loading=\"lazy\" decoding=\"async\" src=\"https:\/\/oyshop.com.co\/wp-content\/uploads\/2023\/08\/ciberseguridad-900x600-1.jpg\" alt=\"\" class=\"wp-image-953\" style=\"object-fit:cover;width:697px;height:474px\" width=\"697\" height=\"474\"\/><\/figure>\n\n\n\n<div style=\"height:27px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<h3 class=\"wp-block-heading\">2.2. Automatizable<\/h3>\n\n\n\n<p>Este punto de decisi\u00f3n del \u00e1rbol SSVC busca responder a una pregunta de gran relevancia:&nbsp;<strong>\u00bfpuede un actor hostil automatizar con \u00e9xito la puesta en marcha de ciberataques para explotar esta vulnerabilidad?<\/strong><\/p>\n\n\n\n<p>La organizaci\u00f3n que est\u00e9 usando SSVC para tomar decisiones sobre la gesti\u00f3n de vulnerabilidades IT deber\u00e1 responder a esta pregunta y seleccionar:<\/p>\n\n\n\n<ul>\n<li>No. Cuando los primeros cuatro pasos de la&nbsp;<strong>Cyber Kill Chain<\/strong>&nbsp;(reconocimiento, preparaci\u00f3n, distribuci\u00f3n y explotaci\u00f3n) no se pueden automatizar para explotar la vulnerabilidad. Entre los posibles motivos, SSVC incluye la existencia de barreras en el sistema que se busca atacar, como configuraciones de seguridad de red que bloquean la entrega o el uso de t\u00e9cnicas de prevenci\u00f3n de exploits.<\/li>\n\n\n\n<li>S\u00ed. Cuando las primeras cuatro etapas de la Cyber Kill Chain s\u00ed se pueden automatizar con \u00e9xito.&nbsp;<strong>SSVC<\/strong>&nbsp;indica que esto puede suceder cuando la vulnerabilidad permite la ejecuci\u00f3n remota de c\u00f3digo o la inyecci\u00f3n de comandos.<\/li>\n<\/ul>\n\n\n\n<p>\u00bfC\u00f3mo se determina si es viable la automatizaci\u00f3n de la explotaci\u00f3n? El analista de ciberseguridad que realiza la&nbsp;<strong>evaluaci\u00f3n de la vulnerabilidad empleando SSVC<\/strong>&nbsp;debe analizar detenidamente las cuatro primeras etapas de la Cyber Kill Chain para rastrear rutas de ataque viables en el escenario que se est\u00e1 analizando y con la informaci\u00f3n que se dispone sobre la vulnerabilidad y el estado de explotaci\u00f3n.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">2.3. Impacto t\u00e9cnico<\/h3>\n\n\n\n<p>La propia gu\u00eda de SSVC equipara este punto de decisi\u00f3n con las m\u00e9tricas base de CVSS, puesto que ambos pivotan en torno al concepto de severidad de la explotaci\u00f3n de una vulnerabilidad. En el caso de SSVC el objetivo es&nbsp;<strong>dilucidar el alcance de la explotaci\u00f3n<\/strong>. O, dicho de otra forma, el nivel de control sobre el sistema que adquiere el actor hostil que explota con \u00e9xito la vulnerabilidad evaluada.<\/p>\n\n\n\n<p>Al igual que en el punto de decisi\u00f3n anterior, el analista de ciberseguridad debe escoger entre dos valores:<\/p>\n\n\n\n<ul>\n<li>Parcial. La explotaci\u00f3n otorga al atacante un control o una informaci\u00f3n limitados sobre el comportamiento del software vulnerable. Adem\u00e1s, el actor hostil tiene una oportunidad muy baja para lograr el control total del software. Un ejemplo de control limitado del comportamiento de un componente que presenta una vulnerabilidad es el ataque de denegaci\u00f3n de servicio.<\/li>\n\n\n\n<li>Total. Mediante la explotaci\u00f3n de la vulnerabilidad, el actor hostil puede<strong>&nbsp;conseguir el control total sobre el comportamiento del software<\/strong>&nbsp;o acceder a toda la informaci\u00f3n del sistema en el que est\u00e1 presente la vulnerabilidad.<\/li>\n<\/ul>\n\n\n\n<h3 class=\"wp-block-heading\">2.4. Misi\u00f3n y bienestar p\u00fablico<\/h3>\n\n\n\n<p>Aunque pueda parecer una perogrullada, en el \u00faltimo punto de decisi\u00f3n, en realidad, se han de tomar dos decisiones que permitir\u00e1n llegar a la decisi\u00f3n final.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\">2.4.1. Prevalencia de la misi\u00f3n<\/h4>\n\n\n\n<p>En primer lugar, es necesario analizar lo que SSVC denomina como prevalencia de la misi\u00f3n. Es decir, si la vulnerabilidad afecta a un componente clave para la continuidad de negocio o para cumplir misiones esenciales como la protecci\u00f3n de la infraestructura cr\u00edtica.<\/p>\n\n\n\n<p>En lo relativo a la prevalencia de la misi\u00f3n, los analistas de seguridad pueden decidir entre tres valores:<\/p>\n\n\n\n<ul>\n<li>M\u00ednimo. El componente afectado por la vulnerabilidad no es esencial para una misi\u00f3n.<\/li>\n\n\n\n<li>Apoyo. El componente solo apoya misiones esenciales.<\/li>\n\n\n\n<li>Esencial. El componente directamente provee capacidades que constituyen por lo menos una misi\u00f3n esencial. Un fallo en este componente puede conducir al fallo de la misi\u00f3n. Por ejemplo,&nbsp;<strong>garantizar la continuidad de negocio<\/strong>.<\/li>\n<\/ul>\n\n\n\n<h4 class=\"wp-block-heading\">2.4.2. Bienestar p\u00fablico<\/h4>\n\n\n\n<p>En segundo lugar, es necesario determinar&nbsp;<strong>c\u00f3mo la explotaci\u00f3n de la vulnerabilidad puede afectar a las personas<\/strong>. En este caso, los valores a escoger son:<\/p>\n\n\n\n<ul>\n<li>M\u00ednimo. Los efectos de un incidente de seguridad son menores a nivel de: da\u00f1o f\u00edsico, ambiental, financiero y psicol\u00f3gico.<\/li>\n\n\n\n<li>Material. Cuando se causa alg\u00fan da\u00f1o de relevancia en los \u00e1mbitos se\u00f1alados antes.<\/li>\n\n\n\n<li>Irreversible. Cuando se pueden producir da\u00f1os de enorme gravedad como v\u00edctimas mortales,&nbsp;<strong>amenaza para la salud p\u00fablica<\/strong>, da\u00f1os medioambientales que provoquen el colapso de un ecosistema o&nbsp;<strong>desestabilizaci\u00f3n de elecciones<\/strong>&nbsp;y sistemas financieros.<\/li>\n<\/ul>\n\n\n\n<p>Los valores de estas dos decisiones se acumulan para tomar la \u00faltima decisi\u00f3n y escoger entre tres valores:<\/p>\n\n\n\n<ul>\n<li>Bajo. Cuando el impacto en el bienestar y en la prevalencia de la misi\u00f3n es m\u00ednimo.<\/li>\n\n\n\n<li>Medio. Cuando el componente afectado por la vulnerabilidad sirve de apoyo a una misi\u00f3n esencial y el impacto de la explotaci\u00f3n puede ser calificado como material.<\/li>\n\n\n\n<li>Alto. El componente es esencial para la prevalencia de la misi\u00f3n y\/o el impacto en el bienestar p\u00fablico es irreversible.<\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\">3. Las 36 ramas del \u00e1rbol SSVC para no perderse en el bosque de las decisiones<\/h2>\n\n\n\n<p>Los puntos de decisi\u00f3n funcionan como nudos del \u00e1rbol SSVC, dando paso a su ramificaci\u00f3n. En su versi\u00f3n 2, el \u00e1rbol SSVC est\u00e1 conformado por 36 ramas. Es decir, 36 escenarios diferentes que se configuran a medida que se van tomando decisiones. Al final de cada una de las ramas se encuentra la acci\u00f3n a tomar para&nbsp;<strong>gestionar la vulnerabilidad<\/strong>, que, como ya se\u00f1alamos antes, puede ser de cuatro tipos, que van desde el mero rastreo hasta la necesidad de actuar inmediatamente para mitigar la vulnerabilidad en el menor tiempo posible.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">3.1. \u00bfEs necesario actualizar de forma inmediata?<\/h3>\n\n\n\n<p>La versi\u00f3n 2 de SSVC, publicada a finales de 2022, incluye cuatro colores para visualizar el nivel de peligrosidad de una vulnerabilidad para una compa\u00f1\u00eda o administraci\u00f3n p\u00fablica concreta:<\/p>\n\n\n\n<ul>\n<li>Verde \u2013 Rastrear. Hasta 18 ramas del \u00e1rbol SSVC concluyen en esta acci\u00f3n. 15 de estas ramas surgen de la valoraci\u00f3n de que la explotaci\u00f3n o bien no es automatizable o bien existe una prueba de concepto, pero a\u00fan no se han recopilado evidencias de que se hayan puesto en marcha ataques capaces de automatizar las primeras cuatro fases de la Cyber Kill Chain.<\/li>\n\n\n\n<li>Amarillo \u2013 Monitorear de cerca. Para cuatro ramas del \u00e1rbol o vectores SSVC se recomienda esta acci\u00f3n.<\/li>\n\n\n\n<li>Naranja \u2013 Atender. En 10 de los 36 escenarios de tomas de decisiones de SSVC se recomienda atender a la vulnerabilidad, involucrando a personal interno y solicitando asistencia externa si fuese necesario.<\/li>\n\n\n\n<li>Rojo \u2013 Actuar de forma inmediata. En solo cuatro escenarios se recomienda actuar con la m\u00e1xima celeridad posible. \u00bfC\u00f3mo se llega a esta decisi\u00f3n final? Tras constatar que&nbsp;<strong>se puede automatizar la explotaci\u00f3n de la vulnerabilidad<\/strong>&nbsp;y tiene un impacto t\u00e9cnico elevado que afecta a&nbsp;<strong>operativas esenciales<\/strong>&nbsp;de la compa\u00f1\u00eda o al&nbsp;<strong>bienestar de las personas<\/strong>; o bien, el impacto t\u00e9cnico solo es parcial, pero las consecuencias para a organizaci\u00f3n y el bienestar p\u00fablico son elevadas.<\/li>\n<\/ul>\n\n\n\n<p>En el caso de que la organizaci\u00f3n sea un proveedor IT, si se recomienda actuar de forma inmediata deber\u00e1&nbsp;<strong>desarrollar un parche<\/strong>&nbsp;en el menor tiempo posible para mitigar la vulnerabilidad. Mientras que, si la recomendaci\u00f3n es de color naranja, ha de acelerar los ritmos de actualizaci\u00f3n habituales. En cambio, si se trata de una empresa o una instituci\u00f3n que emplea software de terceros, en caso de que la evaluaci\u00f3n recomienda actuar ya, ha de aplicar de forma inmediata el parche que mitiga la vulnerabilidad.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">4. Evaluar la dificultad de mitigar una vulnerabilidad<\/h2>\n\n\n\n<p>M\u00e1s all\u00e1 de los puntos de decisi\u00f3n que marcan la evoluci\u00f3n del&nbsp;<strong>\u00e1rbol de decisiones SSVC<\/strong>, la gu\u00eda elaborada por CISA pone el foco sobre otro aspecto a tener en cuenta: el&nbsp;<strong>estado de mitigaci\u00f3n de la vulnerabilidad<\/strong>.<\/p>\n\n\n\n<p>CISA se\u00f1ala que la dificultad de mitigar una vulnerabilidad no debe ser un elemento a tener en cuenta a la hora de tomar decisiones para gestionarla, pero es indispensable evaluar esta cuesti\u00f3n, ya que influir\u00e1 directamente en la capacidad de actuar de la organizaci\u00f3n.<\/p>\n\n\n\n<p>Por ello, se contemplan tres factores para&nbsp;<strong>evaluar el nivel de dificultad que conllevar\u00eda mitigar una vulnerabilidad<\/strong>:<\/p>\n\n\n\n<ol>\n<li><strong>Disponibilidad<\/strong>. \u00bfEl parche o forma de mitigar la vulnerabilidad est\u00e1 p\u00fablicamente disponible o no?<\/li>\n\n\n\n<li><strong>Dificultad de cambiar el sistema<\/strong>. \u00bfEl sistema cuenta con un proceso de actualizaci\u00f3n integrado y la mitigaci\u00f3n no conlleva interrumpir la funci\u00f3n normal del componente vulnerable? De ser as\u00ed, la dificultad ser\u00e1 baja. Si, por el contrario, se cumple alguna de estas condiciones la dificultad ser\u00e1 alta:\n<ul>\n<li>a. El sistema no tiene un proceso de actualizaci\u00f3n integrado.<\/li>\n\n\n\n<li>b. Aplicar la mitigaci\u00f3n conllevar\u00e1 un tiempo de inactividad del componente vulnerable.<\/li>\n\n\n\n<li>c. Tras la mitigaci\u00f3n, la funcionalidad del sistema se ver\u00e1 reducida.<\/li>\n\n\n\n<li>d. El entorno normativo puede impedir la mitigaci\u00f3n.<\/li>\n<\/ul>\n<\/li>\n\n\n\n<li><strong>Tipo de mitigaci\u00f3n<\/strong>. \u00bfLa mitigaci\u00f3n se trata de un parche oficial que remedia la vulnerabilidad? O, en cambio, solo sirve para prevenir la explotaci\u00f3n, sin parchear la vulnerabilidad en s\u00ed misma o consiste en reconfigurar el componente vulnerable.<\/li>\n<\/ol>\n\n\n\n<figure class=\"wp-block-image size-large is-resized\"><img loading=\"lazy\" decoding=\"async\" src=\"https:\/\/oyshop.com.co\/wp-content\/uploads\/2023\/08\/ciberseguridad-1024x576.jpg\" alt=\"\" class=\"wp-image-954\" style=\"object-fit:cover;width:697px;height:474px\" width=\"697\" height=\"474\"\/><\/figure>\n\n\n\n<div style=\"height:38px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<h2 class=\"wp-block-heading\">5. SSVC, CVSS y EPSS: Est\u00e1ndares globales para evaluar las vulnerabilidades IT y actuar en consecuencia<\/h2>\n\n\n\n<p>SSVC no es el sistema definitivo para&nbsp;<strong>categorizar las vulnerabilidades<\/strong>, sino una herramienta m\u00e1s al servicio de los analistas de ciberseguridad, las compa\u00f1\u00edas y las administraciones p\u00fablicas. Los investigadores del Software Engineering Institute de la Carnegie Mellon University defienden en un art\u00edculo centrado en presentar la versi\u00f3n 2 de SSVC que este sistema busca complementar al indicador CVSS, un est\u00e1ndar global en la&nbsp;<strong>evaluaci\u00f3n de vulnerabilidades IT<\/strong>.<\/p>\n\n\n\n<p>Mientras CVSS se centra en medir el nivel de severidad t\u00e9cnica de una vulnerabilidad,&nbsp;<strong>SSVC busca diseccionar el proceso de toma de decisiones para optimizarlo y gestionar las vulnerabilidades con \u00e9xito<\/strong>. Ello se traduce en el hecho de que en CVSS, las m\u00e9tricas de entorno y de amenaza son solo opciones, de tal forma que se puede obtener la puntuaci\u00f3n CVSS cumplimentando, solo, las m\u00e9tricas base. En cambio, en SSVC&nbsp;<strong>el entorno y el estado actual de la amenaza forman parte intr\u00ednseca de la toma de decisiones<\/strong>.<\/p>\n\n\n\n<p>Si bien, cabe precisar que CVSS v4, que viene de hacerse p\u00fablico, incide en la necesidad de que las organizaciones tambi\u00e9n usen las m\u00e9tricas de entorno y de amenaza cuando emplean el est\u00e1ndar para medir la severidad de una vulnerabilidad.<\/p>\n\n\n\n<p>Por otro lado, el uso de SSVC tambi\u00e9n puede combinarse con el manejo de otro indicador desarrollado por FIRST, EPSS, centrado en evaluar la probabilidad de explotaci\u00f3n de una vulnerabilidad en los pr\u00f3ximos 30 d\u00edas. As\u00ed como CVSS puede ser de gran utilidad para evaluar el impacto t\u00e9cnico de una vulnerabilidad, EPSS facilita la evaluaci\u00f3n de su estado de explotaci\u00f3n.<\/p>\n\n\n\n<p>De tal forma que&nbsp;<strong>tanto CVSS como EPSS pueden enriquecer la toma de decisiones a trav\u00e9s del \u00e1rbol SSCV<\/strong>.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">6. Gesti\u00f3n de vulnerabilidades IT, un must para las empresas hoy en d\u00eda<\/h2>\n\n\n\n<p>La existencia de metodolog\u00edas como&nbsp;<strong>SSVC<\/strong>&nbsp;evidencia la relevancia que han adquirido los&nbsp;<strong>servicios de gesti\u00f3n de vulnerabilidades IT<\/strong>&nbsp;en la actualidad. Hasta el punto de que la gesti\u00f3n de vulnerabilidades que afectan a las infraestructuras corporativas se ha convertido en una pieza esencial en las capas defensivas de cualquier compa\u00f1\u00eda.<\/p>\n\n\n\n<p>Al fin y al cabo, en lo que va de a\u00f1o se han descubierto ya casi&nbsp;<strong>15.000 nuevas vulnerabilidades<\/strong>. Sin embargo, no todas ellas presentan el mismo nivel de severidad ni su potencial explotaci\u00f3n afecta de igual forma a todas las compa\u00f1\u00edas o administraciones. De ah\u00ed que sea fundamental gestionarlas para&nbsp;<strong>administrar los recursos t\u00e9cnicos, econ\u00f3micos y humanos de forma eficiente<\/strong>&nbsp;y priorizar la mitigaci\u00f3n de las vulnerabilidades que pueden afectar en mayor medida a cada organizaci\u00f3n y su modelo de negocio.<\/p>\n\n\n\n<p>El&nbsp;<strong>servicio de gesti\u00f3n de vulnerabilidades<\/strong>&nbsp;ha de llevar a cabo una&nbsp;<strong>monitorizaci\u00f3n continua del estado de seguridad de la infraestructura tecnol\u00f3gica<\/strong>, poniendo el foco en la priorizaci\u00f3n de las labores de mitigaci\u00f3n y en la elaboraci\u00f3n de planes de acci\u00f3n que minimicen la exposici\u00f3n de una empresa ante las amenazas.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">6.1. Del descubrimiento a la verificaci\u00f3n<\/h3>\n\n\n\n<p>Los profesionales de ciberseguridad de Tarlogic acometen todas las fases de la&nbsp;<strong>gesti\u00f3n de vulnerabilidades<\/strong>:<\/p>\n\n\n\n<ul>\n<li><strong>Descubrimiento activo de vulnerabilidades<\/strong>&nbsp;que afectan a activos IT de la compa\u00f1\u00eda, mediante la monitorizaci\u00f3n permanente y la recopilaci\u00f3n de informaci\u00f3n sobre vulnerabilidades emergentes.<\/li>\n\n\n\n<li><strong>An\u00e1lisis de las vulnerabilidades<\/strong>, empleando una metodolog\u00eda propia, fruto de la experiencia acumulada durante m\u00e1s de una d\u00e9cada. En esta fase se usan indicadores como SSVC, CVSS o EPSS para optimizar y estandarizar la evaluaci\u00f3n de vulnerabilidades.<\/li>\n\n\n\n<li><strong>Reporting<\/strong>. Se elaboran informes con los resultados del an\u00e1lisis, proponiendo la priorizaci\u00f3n de las medidas de mitigaci\u00f3n de las vulnerabilidades detectadas.<\/li>\n\n\n\n<li><strong>Remediaci\u00f3n<\/strong>. Se ponen en marcha las acciones necesarias para mitigar las vulnerabilidades<\/li>\n\n\n\n<li><strong>Verificaci\u00f3n<\/strong>. Se comprueba que la mitigaci\u00f3n se ha realizado de forma exitosa.<\/li>\n<\/ul>\n\n\n\n<p>En definitiva, la&nbsp;<strong>gesti\u00f3n de vulnerabilidades<\/strong>&nbsp;es una actividad central dentro de la estrategia de seguridad de cualquier empresa en la era digital. De ah\u00ed que organizaciones de referencia a nivel global como FIRST o CISA hayan desarrollado herramientas e indicadores como&nbsp;<strong>SSVC<\/strong>&nbsp;que ayudan a los profesionales de ciberseguridad y a las compa\u00f1\u00edas a&nbsp;<strong>evaluar las vulnerabilidades<\/strong>&nbsp;y&nbsp;<strong>optimizar la toma de decisiones para mitigarlas de forma eficaz<\/strong>&nbsp;y prevenir incidentes de seguridad que pueden generar da\u00f1os econ\u00f3micos, legales, reputacionales e, incluso, afectar al bienestar de las personas.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>SSVC es un sistema que ayuda a analizar las vulnerabilidades para tomar decisiones que contribuyan a prevenir incidentes de seguridad y contener sus consecuencias La BBC, British Airways, el Departamento de Energ\u00eda de Estados Unidos, PwC o Shell son algunas de las&nbsp;organizaciones afectadas&nbsp;por la explotaci\u00f3n exitosa de una vulnerabilidad presente en el software de transferencia &hellip;<\/p>\n<p class=\"read-more\"> <a class=\"\" href=\"https:\/\/oyshop.com.co\/ssvc-como-tomar-decisiones-sobre-las-vulnerabilidades-it\/\"> <span class=\"screen-reader-text\">SSVC: C\u00f3mo tomar decisiones sobre las vulnerabilidades IT<\/span> Leer m\u00e1s &raquo;<\/a><\/p>\n","protected":false},"author":1,"featured_media":971,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_uag_custom_page_level_css":"","site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"narrow-width-container","site-content-style":"unboxed","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"set","footnotes":"","_joinchat":[]},"categories":[34],"tags":[],"jetpack_featured_media_url":"https:\/\/oyshop.com.co\/wp-content\/uploads\/2023\/08\/la-importancia-de-la-ciberseguridad-segun-bd.jpg","uagb_featured_image_src":{"full":["https:\/\/oyshop.com.co\/wp-content\/uploads\/2023\/08\/la-importancia-de-la-ciberseguridad-segun-bd.jpg",1140,490,false],"thumbnail":["https:\/\/oyshop.com.co\/wp-content\/uploads\/2023\/08\/la-importancia-de-la-ciberseguridad-segun-bd-150x150.jpg",150,150,true],"medium":["https:\/\/oyshop.com.co\/wp-content\/uploads\/2023\/08\/la-importancia-de-la-ciberseguridad-segun-bd-300x129.jpg",300,129,true],"medium_large":["https:\/\/oyshop.com.co\/wp-content\/uploads\/2023\/08\/la-importancia-de-la-ciberseguridad-segun-bd-768x330.jpg",768,330,true],"large":["https:\/\/oyshop.com.co\/wp-content\/uploads\/2023\/08\/la-importancia-de-la-ciberseguridad-segun-bd-1024x440.jpg",1024,440,true],"1536x1536":["https:\/\/oyshop.com.co\/wp-content\/uploads\/2023\/08\/la-importancia-de-la-ciberseguridad-segun-bd.jpg",1140,490,false],"2048x2048":["https:\/\/oyshop.com.co\/wp-content\/uploads\/2023\/08\/la-importancia-de-la-ciberseguridad-segun-bd.jpg",1140,490,false],"mailpoet_newsletter_max":["https:\/\/oyshop.com.co\/wp-content\/uploads\/2023\/08\/la-importancia-de-la-ciberseguridad-segun-bd.jpg",1140,490,false],"woocommerce_thumbnail":["https:\/\/oyshop.com.co\/wp-content\/uploads\/2023\/08\/la-importancia-de-la-ciberseguridad-segun-bd-300x300.jpg",300,300,true],"woocommerce_single":["https:\/\/oyshop.com.co\/wp-content\/uploads\/2023\/08\/la-importancia-de-la-ciberseguridad-segun-bd-600x258.jpg",600,258,true],"woocommerce_gallery_thumbnail":["https:\/\/oyshop.com.co\/wp-content\/uploads\/2023\/08\/la-importancia-de-la-ciberseguridad-segun-bd-100x100.jpg",100,100,true]},"uagb_author_info":{"display_name":"oyshopadmin","author_link":"https:\/\/oyshop.com.co\/author\/oyshopadmin\/"},"uagb_comment_info":1,"uagb_excerpt":"SSVC es un sistema que ayuda a analizar las vulnerabilidades para tomar decisiones que contribuyan a prevenir incidentes de seguridad y contener sus consecuencias La BBC, British Airways, el Departamento de Energ\u00eda de Estados Unidos, PwC o Shell son algunas de las&nbsp;organizaciones afectadas&nbsp;por la explotaci\u00f3n exitosa de una vulnerabilidad presente en el software de transferencia&hellip;","_links":{"self":[{"href":"https:\/\/oyshop.com.co\/wp-json\/wp\/v2\/posts\/952"}],"collection":[{"href":"https:\/\/oyshop.com.co\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/oyshop.com.co\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/oyshop.com.co\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/oyshop.com.co\/wp-json\/wp\/v2\/comments?post=952"}],"version-history":[{"count":1,"href":"https:\/\/oyshop.com.co\/wp-json\/wp\/v2\/posts\/952\/revisions"}],"predecessor-version":[{"id":955,"href":"https:\/\/oyshop.com.co\/wp-json\/wp\/v2\/posts\/952\/revisions\/955"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/oyshop.com.co\/wp-json\/wp\/v2\/media\/971"}],"wp:attachment":[{"href":"https:\/\/oyshop.com.co\/wp-json\/wp\/v2\/media?parent=952"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/oyshop.com.co\/wp-json\/wp\/v2\/categories?post=952"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/oyshop.com.co\/wp-json\/wp\/v2\/tags?post=952"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}