{"id":80,"date":"2019-01-23T12:20:04","date_gmt":"2019-01-23T12:20:04","guid":{"rendered":"https:\/\/oyshop.com.co\/producto\/star-cactus\/"},"modified":"2023-10-30T20:09:26","modified_gmt":"2023-10-31T01:09:26","slug":"star-cactus","status":"publish","type":"product","link":"https:\/\/oyshop.com.co\/producto\/star-cactus\/","title":{"rendered":"FUENTE 850W SFX COOLER MASTER MWE 80 P GOLD"},"content":{"rendered":"<p>Despu\u00e9s de mucha demanda, finalmente hemos producido una fuente de alimentaci\u00f3n hecha espec\u00edficamente para satisfacer las necesidades de los constructores de sistemas mini-ITX. Esta unidad ofrece un rendimiento superior en niveles de 550, 650, 750 y 850 vatios. Ofrece una calificaci\u00f3n de eficiencia 80 PLUS Gold, cableado completamente modular, un ventilador FDB de 92 mm, cables PCIe de alta eficiencia 16AWG, condensadores 100% japoneses y una garant\u00eda de 10 a\u00f1os. Y con el soporte de SFX a ATX incluido, esta unidad es compatible con carcasas que van desde mini-ITX hasta sistemas E-ATX.<\/p>\n<p>El V SFX Gold ofrece el rendimiento de alta calidad que espera de la serie V en un factor de forma compatible con mini-ITX. A medida que ha aumentado la demanda de sistemas m\u00e1s peque\u00f1os, la gente ha luchado por encontrar unidades de suministro de energ\u00eda de marcas y series en las que conf\u00edan en la categor\u00eda SFX. Aunque no lleg\u00f3 tan pronto como lo planeamos originalmente, Cooler Master se complace en poder finalmente proporcionar una fuente de alimentaci\u00f3n confiable y de alta calidad que es compatible con carcasas m\u00e1s peque\u00f1as y sus componentes acompa\u00f1antes. Una reducci\u00f3n de tama\u00f1o nunca deber\u00eda significar una reducci\u00f3n de la calidad y con el V SFX Gold, no es as\u00ed. Hazlo mini. Haz lo tuyo.<\/p>\n<p>La eficiencia de su fuente de alimentaci\u00f3n es importante porque afecta directamente el rendimiento de su sistema y su factura de energ\u00eda. La calificaci\u00f3n de eficiencia no refleja la calidad o confiabilidad de una fuente de alimentaci\u00f3n. Solo refleja la capacidad de la unidad para mover energ\u00eda desde la pared a sus componentes. Cuanto mayor sea la eficiencia de una fuente de alimentaci\u00f3n, menor ser\u00e1 la cantidad total de energ\u00eda que necesita para alimentar su sistema. La serie V SFX Gold tiene una calificaci\u00f3n de eficiencia 80 PLUS Gold, lo que significa que tiene una eficiencia t\u00edpica garantizada del 90%.<\/p>\n<p>Aunque el V SFX Gold se hizo para compilaciones mini-ITX, en realidad tambi\u00e9n se puede usar para cualquier carcasa ATX. Con el soporte de SFX a ATX incluido, puede convertir instant\u00e1neamente esta unidad de SFX a ATX PSU. Eso hace que este producto sea la primera unidad de fuente de alimentaci\u00f3n de Cooler Master que se puede utilizar para alimentar sistemas que van desde tan peque\u00f1os como mini-ITX hasta placas base E-ATX. El lema de Cooler Master es \u00abHazlo tuyo\u00bb y con la compatibilidad casi universal de la carcasa del V SFX Gold, puedes usar esta fuente de alimentaci\u00f3n para construir casi cualquier sistema que desees.<\/p>\n<p>Dos de los principales beneficios de una construcci\u00f3n mini-ITX son los requisitos de tama\u00f1o reducido y la reducci\u00f3n del ruido. La principal causa de ruido en una fuente de alimentaci\u00f3n suele ser el ventilador. El V SFX Gold utiliza un ventilador FDB de 92 mm, por lo que es extremadamente silencioso. Con su peque\u00f1o tama\u00f1o, alta eficiencia y excelente disipaci\u00f3n de calor, el ruido general se mantiene al m\u00ednimo absoluto.<\/p>\n<p>Un estuche mini-ITX significa un espacio m\u00ednimo para todo. Eso no solo significa una reducci\u00f3n del espacio para la fuente de alimentaci\u00f3n, sino tambi\u00e9n para los cables que la acompa\u00f1an. Es por eso que el V SFX Gold ofrece cableado completamente modular. Utilice el m\u00ednimo absoluto de espacio para la gesti\u00f3n de cables utilizando el m\u00ednimo absoluto de cables. Conecte solo los que necesita para que su sistema conserve la mayor cantidad de espacio posible, lo que se traduce en un mejor flujo de aire y una mejor presentaci\u00f3n.<\/p>\n<p>La serie V SFX Gold ofrece unidades de suministro de energ\u00eda de la m\u00e1s alta calidad que pueden y brindar\u00e1n un rendimiento de grado profesional a niveles de potencia de uso normal. El hecho de que se reduzca el tama\u00f1o de la fuente de alimentaci\u00f3n no significa que la calidad deba serlo. Y con esta unidad, puede estar seguro de que no es as\u00ed. Puede confiar en esta fuente de alimentaci\u00f3n para todas sus necesidades inform\u00e1ticas, ya sea un trabajo informal o sesiones de juego continuas y pesadas.<\/p>\n<p>&nbsp;<\/p>\n<div class=\"aux-col\">\n<p><strong>Versi\u00f3n ATX<\/strong>: SFX 12V Ver. 3.42<\/p>\n<\/div>\n<div class=\"aux-col\">\n<p><strong>PFC<\/strong>: PFC activo<\/p>\n<\/div>\n<div class=\"aux-col\">\n<p><strong>Voltaje de entrada<\/strong>: 100-240V<\/p>\n<\/div>\n<div class=\"aux-col\">\n<p><strong>Corriente de entrada<\/strong>: 12-6A<\/p>\n<\/div>\n<div class=\"aux-col\">\n<p><strong>Frecuencia de entrada:\u00a0<\/strong>50-60Hz<\/p>\n<\/div>\n<div class=\"aux-col\">\n<p><strong>Dimensiones (L x An x Al)<\/strong>: 100x125x63,5mm<\/p>\n<\/div>\n<div class=\"aux-col\">\n<p><strong>Tama\u00f1o del ventilador<\/strong>: 92 mm<\/p>\n<\/div>\n<div class=\"aux-col\">\n<p><strong>Cojinete de ventilador:\u00a0<\/strong>FDB<\/p>\n<\/div>\n<div class=\"aux-col\">\n<p><strong>Eficiencia<\/strong>: 90% a carga t\u00edpica<\/p>\n<\/div>\n<div class=\"aux-col\">\n<p><strong>Calificaci\u00f3n 80 PLUS<\/strong>: 80 M\u00c1S oro<\/p>\n<\/div>\n<div class=\"aux-col\">\n<p><strong>Temperatura de funcionamiento<\/strong>: 0-50\u00b0C<\/p>\n<\/div>\n<div class=\"aux-col\">\n<p><strong>Potencia buena se\u00f1al<\/strong>: 100 \u2013 500ms<\/p>\n<\/div>\n<div class=\"aux-col\">\n<p><strong>Tiempo de espera<\/strong>: 16ms<\/p>\n<\/div>\n<div class=\"aux-col\">\n<p><strong>MTBF<\/strong>: &gt;100.000 horas<\/p>\n<\/div>\n<div class=\"aux-col\">\n<p><strong>Protecciones<\/strong>: OVP, OPP, SCP, OCP, UVP, OTP, protecci\u00f3n contra sobretensiones e irrupci\u00f3n<\/p>\n<\/div>\n","protected":false},"excerpt":{"rendered":"<div class=\"woocommerce-product-details__short-description\">\n<p>El V SFX Gold es el debut de Cooler Master en las unidades de fuente de alimentaci\u00f3n SFX.<\/p>\n<\/div>\n","protected":false},"featured_media":774,"comment_status":"open","ping_status":"closed","template":"","meta":{"_uag_custom_page_level_css":"","site-sidebar-layout":"default","site-content-layout":"default","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"default","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"set","_joinchat":[]},"product_cat":[28],"product_tag":[],"uagb_featured_image_src":{"full":["https:\/\/oyshop.com.co\/wp-content\/uploads\/2019\/01\/14185.png",1000,1000,false],"thumbnail":["https:\/\/oyshop.com.co\/wp-content\/uploads\/2019\/01\/14185-150x150.png",150,150,true],"medium":["https:\/\/oyshop.com.co\/wp-content\/uploads\/2019\/01\/14185-300x300.png",300,300,true],"medium_large":["https:\/\/oyshop.com.co\/wp-content\/uploads\/2019\/01\/14185-768x768.png",768,768,true],"large":["https:\/\/oyshop.com.co\/wp-content\/uploads\/2019\/01\/14185.png",1000,1000,false],"1536x1536":["https:\/\/oyshop.com.co\/wp-content\/uploads\/2019\/01\/14185.png",1000,1000,false],"2048x2048":["https:\/\/oyshop.com.co\/wp-content\/uploads\/2019\/01\/14185.png",1000,1000,false],"mailpoet_newsletter_max":["https:\/\/oyshop.com.co\/wp-content\/uploads\/2019\/01\/14185.png",1000,1000,false],"woocommerce_thumbnail":["https:\/\/oyshop.com.co\/wp-content\/uploads\/2019\/01\/14185-300x300.png",300,300,true],"woocommerce_single":["https:\/\/oyshop.com.co\/wp-content\/uploads\/2019\/01\/14185-600x600.png",600,600,true],"woocommerce_gallery_thumbnail":["https:\/\/oyshop.com.co\/wp-content\/uploads\/2019\/01\/14185-100x100.png",100,100,true]},"uagb_author_info":{"display_name":"oyshopadmin","author_link":"https:\/\/oyshop.com.co\/author\/"},"uagb_comment_info":1,"uagb_excerpt":"El V SFX Gold es el debut de Cooler Master en las unidades de fuente de alimentaci\u00f3n SFX.","_links":{"self":[{"href":"https:\/\/oyshop.com.co\/wp-json\/wp\/v2\/product\/80"}],"collection":[{"href":"https:\/\/oyshop.com.co\/wp-json\/wp\/v2\/product"}],"about":[{"href":"https:\/\/oyshop.com.co\/wp-json\/wp\/v2\/types\/product"}],"replies":[{"embeddable":true,"href":"https:\/\/oyshop.com.co\/wp-json\/wp\/v2\/comments?post=80"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/oyshop.com.co\/wp-json\/wp\/v2\/media\/774"}],"wp:attachment":[{"href":"https:\/\/oyshop.com.co\/wp-json\/wp\/v2\/media?parent=80"}],"wp:term":[{"taxonomy":"product_cat","embeddable":true,"href":"https:\/\/oyshop.com.co\/wp-json\/wp\/v2\/product_cat?post=80"},{"taxonomy":"product_tag","embeddable":true,"href":"https:\/\/oyshop.com.co\/wp-json\/wp\/v2\/product_tag?post=80"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}